[Killed] BooleanLiteral
extension/src/extension/activate.ts:46:36
       provider,
       {
         webviewOptions: {
-          retainContextWhenHidden: true,
+          retainContextWhenHidden: false,
         },
       }
killedBy: extension activate API registers the webview view provider with the correct viewType; Extension activate should register the webview view provider
statusReason: expected "spy" to be called with arguments: [ 'codegraphy.graphView', …(2) ]

Received: 

  1st spy call:

  [
    "codegraphy.graphView",

[Killed] ObjectLiteral
extension/src/extension/activate.ts:53:7
     vscode.window.registerWebviewViewProvider(
       GraphViewProvider.timelineViewType,
       provider,
-      {
-        webviewOptions: {
-          retainContextWhenHidden: true,
-        },
-      }
+      {}
     )
   );
killedBy: extension activate API registers the webview view provider with the correct viewType; Extension activate should register the webview view provider
statusReason: expected "spy" to be called with arguments: [ 'codegraphy.timelineView', …(2) ]

Received: 

  1st spy call:

@@ -1,8 +1,421 @@
  [

[Killed] ObjectLiteral
extension/src/extension/activate.ts:54:25
       GraphViewProvider.timelineViewType,
       provider,
       {
-        webviewOptions: {
-          retainContextWhenHidden: true,
-        },
+        webviewOptions: {},
       }
     )
killedBy: extension activate API registers the webview view provider with the correct viewType; Extension activate should register the webview view provider
statusReason: expected "spy" to be called with arguments: [ 'codegraphy.timelineView', …(2) ]

Received: 

  1st spy call:

@@ -1,8 +1,421 @@
  [

[Killed] ArrowFunction
extension/src/extension/activate.ts:68:19
   registerCommands(context, provider);
 
   return {
-    getGraphData: () => provider.getGraphData(),
+    getGraphData: () => undefined,
     sendToWebview: (message) => provider.sendToWebview(message),
     onWebviewMessage: (handler) => provider.onWebviewMessage(handler),
killedBy: activate() API return values delegate to provider getGraphData returns the actual graph data from the provider
statusReason: expected undefined to be { Object (nodes, edges) } // Object.is equality

[Killed] ArrowFunction
extension/src/extension/activate.ts:69:20
 
   return {
     getGraphData: () => provider.getGraphData(),
-    sendToWebview: (message) => provider.sendToWebview(message),
+    sendToWebview: () => undefined,
     onWebviewMessage: (handler) => provider.onWebviewMessage(handler),
     dispatchWebviewMessage: (message) => provider.dispatchWebviewMessage(message),
killedBy: activate() API return values delegate to provider sendToWebview delegates the message to the provider
statusReason: expected "spy" to be called with arguments: [ { type: 'TEST', payload: 42 } ]

Number of calls: 0

[Killed] ArrowFunction
extension/src/extension/activate.ts:70:23
   return {
     getGraphData: () => provider.getGraphData(),
     sendToWebview: (message) => provider.sendToWebview(message),
-    onWebviewMessage: (handler) => provider.onWebviewMessage(handler),
+    onWebviewMessage: () => undefined,
     dispatchWebviewMessage: (message) => provider.dispatchWebviewMessage(message),
     onExtensionMessage: (handler) => provider.onExtensionMessage(handler),
killedBy: activate() API return values delegate to provider onWebviewMessage delegates to the provider and returns a disposable
statusReason: expected "spy" to be called with arguments: [ [Function spy] ]

Number of calls: 0

[Killed] ArrowFunction
extension/src/extension/activate.ts:71:29
     getGraphData: () => provider.getGraphData(),
     sendToWebview: (message) => provider.sendToWebview(message),
     onWebviewMessage: (handler) => provider.onWebviewMessage(handler),
-    dispatchWebviewMessage: (message) => provider.dispatchWebviewMessage(message),
+    dispatchWebviewMessage: () => undefined,
     onExtensionMessage: (handler) => provider.onExtensionMessage(handler),
     registerPlugin: (plugin: unknown, options?: { extensionUri?: vscode.Uri | string }) =>
killedBy: activate dispatches webview messages through the provider
statusReason: You must provide a Promise to expect() when using .resolves, not 'undefined'.

[Killed] ArrowFunction
extension/src/extension/activate.ts:72:25
     sendToWebview: (message) => provider.sendToWebview(message),
     onWebviewMessage: (handler) => provider.onWebviewMessage(handler),
     dispatchWebviewMessage: (message) => provider.dispatchWebviewMessage(message),
-    onExtensionMessage: (handler) => provider.onExtensionMessage(handler),
+    onExtensionMessage: () => undefined,
     registerPlugin: (plugin: unknown, options?: { extensionUri?: vscode.Uri | string }) =>
       provider.registerExternalPlugin(plugin, options),
killedBy: activate registers extension message listeners through the provider
statusReason: expected undefined to be { dispose: [Function spy] } // Object.is equality

[Killed] ArrowFunction
extension/src/extension/activate.ts:73:21
     onWebviewMessage: (handler) => provider.onWebviewMessage(handler),
     dispatchWebviewMessage: (message) => provider.dispatchWebviewMessage(message),
     onExtensionMessage: (handler) => provider.onExtensionMessage(handler),
-    registerPlugin: (plugin: unknown, options?: { extensionUri?: vscode.Uri | string }) =>
-      provider.registerExternalPlugin(plugin, options),
+    registerPlugin: () => undefined,
   };
 }
killedBy: activate() API return values delegate to provider registerPlugin delegates to the provider with plugin and options
statusReason: expected "spy" to be called with arguments: [ { id: 'test-plugin' }, …(1) ]

Number of calls: 0
