[Killed] ObjectLiteral
extension/graphView/provider/pluginBroadcasts.ts:59:76
     DEFAULT_GRAPH_VIEW_PROVIDER_PLUGIN_BROADCAST_DEPENDENCIES,
   defaultDepthLimit: number,
 ): GraphViewProviderPluginBroadcastMethods {
-  const resolved: Required<GraphViewProviderPluginBroadcastDependencies> = {
-    ...DEFAULT_GRAPH_VIEW_PROVIDER_PLUGIN_BROADCAST_DEPENDENCIES,
-    ...dependencies,
-  };
+  const resolved: Required<GraphViewProviderPluginBroadcastDependencies> = {};
 
   const send = (message: unknown): void => {
killedBy: graphView/provider/pluginBroadcasts forwards broadcasts through the provider message bridge
statusReason: resolved.sendDepthState is not a function

[Killed] BlockStatement
extension/graphView/provider/pluginBroadcasts.ts:64:44
     ...dependencies,
   };
 
-  const send = (message: unknown): void => {
-    source._sendMessage(message as ExtensionToWebviewMessage);
-  };
+  const send = (message: unknown): void => {};
 
   return {
killedBy: graphView/provider/pluginBroadcasts forwards broadcasts through the provider message bridge
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
extension/graphView/provider/pluginBroadcasts.ts:69:28
   };
 
   return {
-    _sendDepthState: () => {
-      resolved.sendDepthState(
-        source._viewContext,
-        source._depthMode,
-        source._rawGraphData,
-        defaultDepthLimit,
-        send,
-      );
-    },
+    _sendDepthState: () => {},
     _sendGraphControls: () => {
       sendGraphControlsUpdated(
killedBy: graphView/provider/pluginBroadcasts forwards broadcasts through the provider message bridge
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
    {

[Killed] BlockStatement
extension/graphView/provider/pluginBroadcasts.ts:78:31
         send,
       );
     },
-    _sendGraphControls: () => {
-      sendGraphControlsUpdated(
-        source._graphData,
-        source._analyzer,
-        message => send(message),
-        getCodeGraphyConfiguration(),
-      );
-    },
+    _sendGraphControls: () => {},
     _sendPluginStatuses: () => {
       resolved.sendPluginStatuses(
killedBy: graphView/provider/pluginBroadcasts sends graph controls and plugin exporters through the provider bridge
statusReason: expected "sendGraphControlsUpdated" to be called with arguments: [ { nodes: [], edges: [] }, …(3) ]

Number of calls: 0

[Killed] ArrowFunction
extension/graphView/provider/pluginBroadcasts.ts:82:9
       sendGraphControlsUpdated(
         source._graphData,
         source._analyzer,
-        message => send(message),
+        () => undefined,
         getCodeGraphyConfiguration(),
       );
killedBy: graphView/provider/pluginBroadcasts sends graph controls and plugin exporters through the provider bridge
statusReason: expected "spy" to be called with arguments: [ { …(2) } ]

Received: 

  1st spy call:

  [
    {

[Killed] BlockStatement
extension/graphView/provider/pluginBroadcasts.ts:86:32
         getCodeGraphyConfiguration(),
       );
     },
-    _sendPluginStatuses: () => {
-      resolved.sendPluginStatuses(
-        source._analyzer,
-        source._disabledPlugins,
-        send,
-      );
-    },
+    _sendPluginStatuses: () => {},
     _sendDecorations: () => {
       resolved.sendDecorations(source._decorationManager, send);
killedBy: graphView/provider/plugins forwards view and plugin broadcasts
statusReason: expected "spy" to be called with arguments: [ { type: 'PLUGINS_UPDATED', …(1) } ]

Received: 

  1st spy call:

  [
    {

[Killed] BlockStatement
extension/graphView/provider/pluginBroadcasts.ts:93:29
         send,
       );
     },
-    _sendDecorations: () => {
-      resolved.sendDecorations(source._decorationManager, send);
-    },
+    _sendDecorations: () => {},
     _sendContextMenuItems: () => {
       resolved.sendContextMenuItems(source._analyzer, send);
killedBy: graphView/provider/plugins forwards decoration payloads through the provider message bridge
statusReason: expected "spy" to be called with arguments: [ { …(2) } ]

Number of calls: 0

[Killed] BlockStatement
extension/graphView/provider/pluginBroadcasts.ts:96:34
     _sendDecorations: () => {
       resolved.sendDecorations(source._decorationManager, send);
     },
-    _sendContextMenuItems: () => {
-      resolved.sendContextMenuItems(source._analyzer, send);
-    },
+    _sendContextMenuItems: () => {},
     _sendPluginExporters: () => {
       resolved.sendPluginExporters(source._analyzer, send);
killedBy: graphView/provider/plugins forwards context menu payloads through the provider message bridge
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
extension/graphView/provider/pluginBroadcasts.ts:99:33
     _sendContextMenuItems: () => {
       resolved.sendContextMenuItems(source._analyzer, send);
     },
-    _sendPluginExporters: () => {
-      resolved.sendPluginExporters(source._analyzer, send);
-    },
+    _sendPluginExporters: () => {},
     _sendPluginToolbarActions: () => {
       resolved.sendPluginToolbarActions(source._analyzer, send);
killedBy: graphView/provider/pluginBroadcasts sends graph controls and plugin exporters through the provider bridge
statusReason: expected "spy" to be called with arguments: [ { registry: { …(5) }, …(1) }, …(1) ]

Number of calls: 0

[Killed] BlockStatement
extension/graphView/provider/pluginBroadcasts.ts:102:38
     _sendPluginExporters: () => {
       resolved.sendPluginExporters(source._analyzer, send);
     },
-    _sendPluginToolbarActions: () => {
-      resolved.sendPluginToolbarActions(source._analyzer, send);
-    },
+    _sendPluginToolbarActions: () => {},
     _sendPluginWebviewInjections: () => {
       resolved.sendPluginWebviewInjections(
killedBy: graphView/provider/plugins forwards external plugin registration callbacks to the current provider methods
statusReason: expected "spy" to be called once, but got 0 times

[Killed] BlockStatement
extension/graphView/provider/pluginBroadcasts.ts:105:41
     _sendPluginToolbarActions: () => {
       resolved.sendPluginToolbarActions(source._analyzer, send);
     },
-    _sendPluginWebviewInjections: () => {
-      resolved.sendPluginWebviewInjections(
-        source._analyzer,
-        (assetPath, pluginId) => source._resolveWebviewAssetPath(assetPath, pluginId),
-        send,
-      );
-    },
+    _sendPluginWebviewInjections: () => {},
     _sendGroupsUpdated: () => {
       resolved.sendGroupsUpdated(
killedBy: graphView/provider/plugins forwards external plugin registration callbacks to the current provider methods
statusReason: expected "spy" to be called once, but got 0 times

[Killed] ArrowFunction
extension/graphView/provider/pluginBroadcasts.ts:108:9
     _sendPluginWebviewInjections: () => {
       resolved.sendPluginWebviewInjections(
         source._analyzer,
-        (assetPath, pluginId) => source._resolveWebviewAssetPath(assetPath, pluginId),
+        () => undefined,
         send,
       );
killedBy: graphView/provider/pluginBroadcasts uses provider-owned resource helpers and workspace folders for group updates
statusReason: expected undefined to be 'asset://icon.svg' // Object.is equality

[Killed] BlockStatement
extension/graphView/provider/pluginBroadcasts.ts:112:31
         send,
       );
     },
-    _sendGroupsUpdated: () => {
-      resolved.sendGroupsUpdated(
-        source._groups,
-        {
-          registerPluginRoots: () => source._registerBuiltInPluginRoots(),
-          workspaceFolder: resolved.getWorkspaceFolders()?.[0],
-          view: source._view ?? source._timelineView,
-          panels: source._panels,
-          resolvePluginAssetPath: (assetPath, pluginId) =>
-            source._resolveWebviewAssetPath(assetPath, pluginId),
-        },
-        send,
-      );
-    },
+    _sendGroupsUpdated: () => {},
   };
 }
killedBy: graphView/provider/pluginBroadcasts forwards broadcasts through the provider message bridge
statusReason: expected "spy" to be called with arguments: [ { type: 'LEGENDS_UPDATED', …(1) } ]

Received: 

  1st spy call:

  [
    {

[Killed] ArrowFunction
extension/graphView/provider/pluginBroadcasts.ts:116:32
       resolved.sendGroupsUpdated(
         source._groups,
         {
-          registerPluginRoots: () => source._registerBuiltInPluginRoots(),
+          registerPluginRoots: () => undefined,
           workspaceFolder: resolved.getWorkspaceFolders()?.[0],
           view: source._view ?? source._timelineView,
killedBy: graphView/provider/pluginBroadcasts uses provider-owned resource helpers and workspace folders for group updates
statusReason: expected "spy" to be called once, but got 0 times

[Killed] OptionalChaining
extension/graphView/provider/pluginBroadcasts.ts:117:28
         source._groups,
         {
           registerPluginRoots: () => source._registerBuiltInPluginRoots(),
-          workspaceFolder: resolved.getWorkspaceFolders()?.[0],
+          workspaceFolder: resolved.getWorkspaceFolders()[0],
           view: source._view ?? source._timelineView,
           panels: source._panels,
killedBy: graphView/provider/pluginBroadcasts falls back to the timeline view when the main view is unavailable
statusReason: Cannot read properties of undefined (reading '0')

[Killed] LogicalOperator
extension/graphView/provider/pluginBroadcasts.ts:118:17
         {
           registerPluginRoots: () => source._registerBuiltInPluginRoots(),
           workspaceFolder: resolved.getWorkspaceFolders()?.[0],
-          view: source._view ?? source._timelineView,
+          view: source._view && source._timelineView,
           panels: source._panels,
           resolvePluginAssetPath: (assetPath, pluginId) =>
killedBy: graphView/provider/pluginBroadcasts falls back to the timeline view when the main view is unavailable
statusReason: expected "spy" to be called with arguments: [ [], ObjectContaining{…}, …(1) ]

Received: 

  1st spy call:

  [
    [],

[Killed] ArrowFunction
extension/graphView/provider/pluginBroadcasts.ts:120:35
           workspaceFolder: resolved.getWorkspaceFolders()?.[0],
           view: source._view ?? source._timelineView,
           panels: source._panels,
-          resolvePluginAssetPath: (assetPath, pluginId) =>
-            source._resolveWebviewAssetPath(assetPath, pluginId),
+          resolvePluginAssetPath: () => undefined,
         },
         send,
killedBy: graphView/provider/pluginBroadcasts uses provider-owned resource helpers and workspace folders for group updates
statusReason: expected undefined to be 'asset://icon.svg' // Object.is equality
