[Killed] BlockStatement
extension/graphView/provider/pluginResources.ts:54:126
   getWorkspaceFolders(): readonly vscode.WorkspaceFolder[] | undefined;
 }
 
-function createDefaultGraphViewProviderPluginResourceMethodDependencies(): GraphViewProviderPluginResourceMethodDependencies {
-  return {
-    registerBuiltInPluginRoots: registerBuiltInGraphViewPluginRoots,
-    getPluginDefaultGroups: getGraphViewPluginDefaultGroups,
-    getBuiltInDefaultGroups: getBuiltInGraphViewDefaultGroups,
-    buildMergedGroups: buildGraphViewMergedGroups,
-    resolvePluginAssetPath: resolveGraphViewPluginAssetPath,
-    getWebviewResourceRoots: getGraphViewWebviewResourceRoots,
-    refreshWebviewResourceRoots: refreshGraphViewResourceRoots,
-    normalizeExtensionUri: normalizeGraphViewExtensionUri,
-    getDefaultLegendVisibility: () =>
-      getCodeGraphyConfiguration().get<Record<string, boolean>>('legendVisibility', {}) ?? {},
-    getLegendOrder: () =>
-      getCodeGraphyConfiguration().get<string[]>('legendOrder', []) ?? [],
-    getWorkspaceFolders: () => vscode.workspace.workspaceFolders,
-  };
-}
+function createDefaultGraphViewProviderPluginResourceMethodDependencies(): GraphViewProviderPluginResourceMethodDependencies {}
 
 export function createGraphViewProviderPluginResourceMethods(
killedBy: graphView/provider/pluginResources uses the default dependency set for workspace resource roots and uri normalization
statusReason: Cannot read properties of undefined (reading 'normalizeExtensionUri')

[Killed] ObjectLiteral
extension/graphView/provider/pluginResources.ts:55:10
 }
 
 function createDefaultGraphViewProviderPluginResourceMethodDependencies(): GraphViewProviderPluginResourceMethodDependencies {
-  return {
-    registerBuiltInPluginRoots: registerBuiltInGraphViewPluginRoots,
-    getPluginDefaultGroups: getGraphViewPluginDefaultGroups,
-    getBuiltInDefaultGroups: getBuiltInGraphViewDefaultGroups,
-    buildMergedGroups: buildGraphViewMergedGroups,
-    resolvePluginAssetPath: resolveGraphViewPluginAssetPath,
-    getWebviewResourceRoots: getGraphViewWebviewResourceRoots,
-    refreshWebviewResourceRoots: refreshGraphViewResourceRoots,
-    normalizeExtensionUri: normalizeGraphViewExtensionUri,
-    getDefaultLegendVisibility: () =>
-      getCodeGraphyConfiguration().get<Record<string, boolean>>('legendVisibility', {}) ?? {},
-    getLegendOrder: () =>
-      getCodeGraphyConfiguration().get<string[]>('legendOrder', []) ?? [],
-    getWorkspaceFolders: () => vscode.workspace.workspaceFolders,
-  };
+  return {};
 }
 
killedBy: graphView/provider/pluginResources uses the default dependency set for workspace resource roots and uri normalization
statusReason: resolvedDependencies.normalizeExtensionUri is not a function

[Killed] ArrowFunction
extension/graphView/provider/pluginResources.ts:64:33
     getWebviewResourceRoots: getGraphViewWebviewResourceRoots,
     refreshWebviewResourceRoots: refreshGraphViewResourceRoots,
     normalizeExtensionUri: normalizeGraphViewExtensionUri,
-    getDefaultLegendVisibility: () =>
-      getCodeGraphyConfiguration().get<Record<string, boolean>>('legendVisibility', {}) ?? {},
+    getDefaultLegendVisibility: () => undefined,
     getLegendOrder: () =>
       getCodeGraphyConfiguration().get<string[]>('legendOrder', []) ?? [],
killedBy: graphView/provider/pluginResources default dependencies reads legend visibility and legend order defaults from the CodeGraphy configuration
statusReason: expected 'legendOrder' to be 'legendVisibility' // Object.is equality

[Killed] LogicalOperator
extension/graphView/provider/pluginResources.ts:65:7
     refreshWebviewResourceRoots: refreshGraphViewResourceRoots,
     normalizeExtensionUri: normalizeGraphViewExtensionUri,
     getDefaultLegendVisibility: () =>
-      getCodeGraphyConfiguration().get<Record<string, boolean>>('legendVisibility', {}) ?? {},
+      getCodeGraphyConfiguration().get<Record<string, boolean>>('legendVisibility', {}) && {},
     getLegendOrder: () =>
       getCodeGraphyConfiguration().get<string[]>('legendOrder', []) ?? [],
killedBy: graphView/provider/pluginResources default dependencies reads legend visibility and legend order defaults from the CodeGraphy configuration
statusReason: expected "spy" to be called with arguments: [ [ { id: 'user', …(2) } ], [], …(3) ]

Received: 

  1st spy call:

@@ -6,13 +6,11 @@
        "pattern": "*.ts",

[Killed] StringLiteral
extension/graphView/provider/pluginResources.ts:65:65
     refreshWebviewResourceRoots: refreshGraphViewResourceRoots,
     normalizeExtensionUri: normalizeGraphViewExtensionUri,
     getDefaultLegendVisibility: () =>
-      getCodeGraphyConfiguration().get<Record<string, boolean>>('legendVisibility', {}) ?? {},
+      getCodeGraphyConfiguration().get<Record<string, boolean>>("", {}) ?? {},
     getLegendOrder: () =>
       getCodeGraphyConfiguration().get<string[]>('legendOrder', []) ?? [],
killedBy: graphView/provider/pluginResources default dependencies reads legend visibility and legend order defaults from the CodeGraphy configuration
statusReason: expected '' to be 'legendVisibility' // Object.is equality

[Killed] ArrowFunction
extension/graphView/provider/pluginResources.ts:66:21
     normalizeExtensionUri: normalizeGraphViewExtensionUri,
     getDefaultLegendVisibility: () =>
       getCodeGraphyConfiguration().get<Record<string, boolean>>('legendVisibility', {}) ?? {},
-    getLegendOrder: () =>
-      getCodeGraphyConfiguration().get<string[]>('legendOrder', []) ?? [],
+    getLegendOrder: () => undefined,
     getWorkspaceFolders: () => vscode.workspace.workspaceFolders,
   };
killedBy: graphView/provider/pluginResources default dependencies reads legend visibility and legend order defaults from the CodeGraphy configuration
statusReason: expected "spy" to be called with arguments: [ [ { id: 'user', …(2) } ], [], …(3) ]

Received: 

  1st spy call:

@@ -9,10 +9,7 @@
    [],

[Killed] LogicalOperator
extension/graphView/provider/pluginResources.ts:67:7
     getDefaultLegendVisibility: () =>
       getCodeGraphyConfiguration().get<Record<string, boolean>>('legendVisibility', {}) ?? {},
     getLegendOrder: () =>
-      getCodeGraphyConfiguration().get<string[]>('legendOrder', []) ?? [],
+      getCodeGraphyConfiguration().get<string[]>('legendOrder', []) && [],
     getWorkspaceFolders: () => vscode.workspace.workspaceFolders,
   };
killedBy: graphView/provider/pluginResources default dependencies reads legend visibility and legend order defaults from the CodeGraphy configuration
statusReason: expected "spy" to be called with arguments: [ [ { id: 'user', …(2) } ], [], …(3) ]

Received: 

  1st spy call:

@@ -9,10 +9,7 @@
    [],

[Killed] ArrayDeclaration
extension/graphView/provider/pluginResources.ts:67:65
     getDefaultLegendVisibility: () =>
       getCodeGraphyConfiguration().get<Record<string, boolean>>('legendVisibility', {}) ?? {},
     getLegendOrder: () =>
-      getCodeGraphyConfiguration().get<string[]>('legendOrder', []) ?? [],
+      getCodeGraphyConfiguration().get<string[]>('legendOrder', ["Stryker was here"]) ?? [],
     getWorkspaceFolders: () => vscode.workspace.workspaceFolders,
   };
killedBy: graphView/provider/pluginResources default dependencies reads legend visibility and legend order defaults from the CodeGraphy configuration
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ArrowFunction
extension/graphView/provider/pluginResources.ts:68:26
       getCodeGraphyConfiguration().get<Record<string, boolean>>('legendVisibility', {}) ?? {},
     getLegendOrder: () =>
       getCodeGraphyConfiguration().get<string[]>('legendOrder', []) ?? [],
-    getWorkspaceFolders: () => vscode.workspace.workspaceFolders,
+    getWorkspaceFolders: () => undefined,
   };
 }
killedBy: graphView/provider/pluginResources uses the default dependency set for workspace resource roots and uri normalization
statusReason: expected [ Array(2) ] to deeply equal [ Array(3) ]

[Killed] LogicalOperator
extension/graphView/provider/pluginResources.ts:77:5
   dependencies?: GraphViewProviderPluginResourceMethodDependencies,
 ): GraphViewProviderPluginResourceMethods {
   const resolvedDependencies =
-    dependencies ?? createDefaultGraphViewProviderPluginResourceMethodDependencies();
+    dependencies && createDefaultGraphViewProviderPluginResourceMethodDependencies();
   const _registerBuiltInPluginRoots = (): void => {
     resolvedDependencies.registerBuiltInPluginRoots(source._extensionUri, source._pluginExtensionUris);
killedBy: graphView/provider/pluginResources registers built-in plugin roots and computes merged groups
statusReason: expected undefined to be '/extension' // Object.is equality

[Killed] BlockStatement
extension/graphView/provider/pluginResources.ts:78:51
 ): GraphViewProviderPluginResourceMethods {
   const resolvedDependencies =
     dependencies ?? createDefaultGraphViewProviderPluginResourceMethodDependencies();
-  const _registerBuiltInPluginRoots = (): void => {
-    resolvedDependencies.registerBuiltInPluginRoots(source._extensionUri, source._pluginExtensionUris);
-  };
+  const _registerBuiltInPluginRoots = (): void => {};
 
   const _getPluginDefaultGroups = (): IGroup[] =>
killedBy: graphView/provider/pluginResources registers built-in plugin roots and computes merged groups
statusReason: expected undefined to be '/extension' // Object.is equality

[Killed] ArrowFunction
extension/graphView/provider/pluginResources.ts:82:35
     resolvedDependencies.registerBuiltInPluginRoots(source._extensionUri, source._pluginExtensionUris);
   };
 
-  const _getPluginDefaultGroups = (): IGroup[] =>
-    resolvedDependencies.getPluginDefaultGroups(
-      source._analyzer,
-      source._disabledPlugins,
-      source._pluginExtensionUris,
-      source._extensionUri,
-    );
+  const _getPluginDefaultGroups = () => undefined;
 
   const _getBuiltInDefaultGroups = (): IGroup[] => resolvedDependencies.getBuiltInDefaultGroups();
killedBy: graphView/provider/pluginResources registers built-in plugin roots and computes merged groups
statusReason: expected "spy" to be called with arguments: [ [ { id: 'user', …(2) } ], …(4) ]

Received: 

  1st spy call:

@@ -11,17 +11,11 @@
        "color": "#000",

[Killed] ArrowFunction
extension/graphView/provider/pluginResources.ts:90:36
       source._extensionUri,
     );
 
-  const _getBuiltInDefaultGroups = (): IGroup[] => resolvedDependencies.getBuiltInDefaultGroups();
+  const _getBuiltInDefaultGroups = () => undefined;
 
   const _computeMergedGroups = (): void => {
killedBy: graphView/provider/pluginResources registers built-in plugin roots and computes merged groups
statusReason: expected "spy" to be called with arguments: [ [ { id: 'user', …(2) } ], …(4) ]

Received: 

  1st spy call:

@@ -4,17 +4,11 @@
        "color": "#fff",

[Killed] BlockStatement
extension/graphView/provider/pluginResources.ts:92:44
 
   const _getBuiltInDefaultGroups = (): IGroup[] => resolvedDependencies.getBuiltInDefaultGroups();
 
-  const _computeMergedGroups = (): void => {
-    source._groups = resolvedDependencies.buildMergedGroups(
-      source._userGroups,
-      _getBuiltInDefaultGroups(),
-      _getPluginDefaultGroups(),
-      resolvedDependencies.getDefaultLegendVisibility(),
-      resolvedDependencies.getLegendOrder(),
-    );
-  };
+  const _computeMergedGroups = (): void => {};
 
   const _resolveWebviewAssetPath = (assetPath: string, pluginId?: string): string =>
killedBy: graphView/provider/pluginResources registers built-in plugin roots and computes merged groups
statusReason: expected "spy" to be called with arguments: [ [ { id: 'user', …(2) } ], …(4) ]

Number of calls: 0

[Killed] ArrowFunction
extension/graphView/provider/pluginResources.ts:102:36
     );
   };
 
-  const _resolveWebviewAssetPath = (assetPath: string, pluginId?: string): string =>
-    resolvedDependencies.resolvePluginAssetPath(
-      assetPath,
-      source._extensionUri,
-      source._pluginExtensionUris,
-      source._view ?? source._timelineView,
-      source._panels,
-      pluginId,
-    );
+  const _resolveWebviewAssetPath = () => undefined;
 
   const _getLocalResourceRoots = (): vscode.Uri[] =>
killedBy: graphView/provider/pluginResources resolves plugin asset paths and local resource roots through the shared helpers
statusReason: expected undefined to be 'asset://icon.svg' // Object.is equality

[Killed] LogicalOperator
extension/graphView/provider/pluginResources.ts:107:7
       assetPath,
       source._extensionUri,
       source._pluginExtensionUris,
-      source._view ?? source._timelineView,
+      source._view && source._timelineView,
       source._panels,
       pluginId,
killedBy: graphView/provider/pluginResources resolves plugin asset paths and local resource roots through the shared helpers
statusReason: expected "spy" to be called with arguments: [ 'icon.svg', …(5) ]

Received: 

  1st spy call:

@@ -3,15 +3,11 @@
    {

[Killed] ArrowFunction
extension/graphView/provider/pluginResources.ts:112:34
       pluginId,
     );
 
-  const _getLocalResourceRoots = (): vscode.Uri[] =>
-    resolvedDependencies.getWebviewResourceRoots(
-      source._extensionUri,
-      source._pluginExtensionUris,
-      resolvedDependencies.getWorkspaceFolders(),
-    );
+  const _getLocalResourceRoots = () => undefined;
 
   const _refreshWebviewResourceRoots = (): void => {
killedBy: graphView/provider/pluginResources resolves plugin asset paths and local resource roots through the shared helpers
statusReason: expected undefined to deeply equal [ { fsPath: '/workspace', …(1) } ]

[Killed] BlockStatement
extension/graphView/provider/pluginResources.ts:119:52
       resolvedDependencies.getWorkspaceFolders(),
     );
 
-  const _refreshWebviewResourceRoots = (): void => {
-    resolvedDependencies.refreshWebviewResourceRoots(
-      source._view,
-      source._panels,
-      _getLocalResourceRoots(),
-    );
-
-    if (source._timelineView) {
-      resolvedDependencies.refreshWebviewResourceRoots(
-        source._timelineView,
-        [],
-        _getLocalResourceRoots(),
-      );
-    }
-  };
+  const _refreshWebviewResourceRoots = (): void => {};
 
   const _normalizeExternalExtensionUri = (
killedBy: graphView/provider/pluginResources resolves plugin asset paths and local resource roots through the shared helpers
statusReason: expected "spy" to be called 3 times, but got 1 times

[Killed] ConditionalExpression
extension/graphView/provider/pluginResources.ts:126:9
       _getLocalResourceRoots(),
     );
 
-    if (source._timelineView) {
+    if (false) {
       resolvedDependencies.refreshWebviewResourceRoots(
         source._timelineView,
killedBy: graphView/provider/pluginResources resolves plugin asset paths and local resource roots through the shared helpers
statusReason: expected "spy" to be called 3 times, but got 2 times

[Killed] BlockStatement
extension/graphView/provider/pluginResources.ts:126:31
       _getLocalResourceRoots(),
     );
 
-    if (source._timelineView) {
-      resolvedDependencies.refreshWebviewResourceRoots(
-        source._timelineView,
-        [],
-        _getLocalResourceRoots(),
-      );
-    }
+    if (source._timelineView) {}
   };
 
killedBy: graphView/provider/pluginResources resolves plugin asset paths and local resource roots through the shared helpers
statusReason: expected "spy" to be called 3 times, but got 2 times

[Killed] ArrowFunction
extension/graphView/provider/pluginResources.ts:135:42
     }
   };
 
-  const _normalizeExternalExtensionUri = (
-    uri: vscode.Uri | string | undefined,
-  ): vscode.Uri | undefined => resolvedDependencies.normalizeExtensionUri(uri);
+  const _normalizeExternalExtensionUri = () => undefined;
 
   return {
killedBy: graphView/provider/pluginResources passes undefined external uris through normalization unchanged
statusReason: expected "spy" to be called with arguments: [ undefined ]

Number of calls: 0

[Killed] ObjectLiteral
extension/graphView/provider/pluginResources.ts:139:10
     uri: vscode.Uri | string | undefined,
   ): vscode.Uri | undefined => resolvedDependencies.normalizeExtensionUri(uri);
 
-  return {
-    _registerBuiltInPluginRoots,
-    _getPluginDefaultGroups,
-    _getBuiltInDefaultGroups,
-    _computeMergedGroups,
-    _resolveWebviewAssetPath,
-    _getLocalResourceRoots,
-    _refreshWebviewResourceRoots,
-    _normalizeExternalExtensionUri,
-  };
+  return {};
 }
 
killedBy: graphView/provider/pluginResources registers built-in plugin roots and computes merged groups
statusReason: methods._registerBuiltInPluginRoots is not a function
