[Killed] BlockStatement
src/extension/graphView/resourceRoots.ts:7:61
   uri: vscode.Uri;
 }
 
-export function getGraphViewUriKey(uri: vscode.Uri): string {
-  const candidate = uri as unknown as { fsPath?: string; path?: string; toString(): string };
-  return candidate.fsPath ?? candidate.path ?? candidate.toString();
-}
+export function getGraphViewUriKey(uri: vscode.Uri): string {}
 
 export function getGraphViewLocalResourceRoots(
killedBy: graphViewResources does not treat embedded protocol text as an already-resolved URL
statusReason: expected undefined to be '/test/extension/dist/http://plugin.js' // Object.is equality

[Killed] LogicalOperator
src/extension/graphView/resourceRoots.ts:9:10
 
 export function getGraphViewUriKey(uri: vscode.Uri): string {
   const candidate = uri as unknown as { fsPath?: string; path?: string; toString(): string };
-  return candidate.fsPath ?? candidate.path ?? candidate.toString();
+  return candidate.fsPath && candidate.path ?? candidate.toString();
 }
 
killedBy: graphViewResources prefers fsPath over path and string conversion for URI keys; graphView/resourceRoots getGraphViewUriKey prefers fsPath over path and string conversion; getGraphViewUriKey (extra mutant coverage) prefers fsPath over path
statusReason: expected '/test/path' to be '/test/fs-path' // Object.is equality

[Killed] LogicalOperator
src/extension/graphView/resourceRoots.ts:9:10
 
 export function getGraphViewUriKey(uri: vscode.Uri): string {
   const candidate = uri as unknown as { fsPath?: string; path?: string; toString(): string };
-  return candidate.fsPath ?? candidate.path ?? candidate.toString();
+  return (candidate.fsPath ?? candidate.path) && candidate.toString();
 }
 
killedBy: graphViewResources does not treat embedded protocol text as an already-resolved URL; graphView/resourceRoots getGraphViewUriKey prefers fsPath over path and string conversion; resolveGraphViewAssetPath (extra mutant coverage) resolves relative path against extension URI when no pluginId given
statusReason: expected '[object Object]' to be '/test/extension/dist/http://plugin.js' // Object.is equality

[Killed] BlockStatement
src/extension/graphView/resourceRoots.ts:16:17
   extensionUri: vscode.Uri,
   pluginExtensionUris: ReadonlyMap<string, vscode.Uri>,
   workspaceFolders: readonly IWorkspaceFolderLike[] | undefined
-): vscode.Uri[] {
-  const roots = new Map<string, vscode.Uri>();
-  roots.set(getGraphViewUriKey(extensionUri), extensionUri);
-
-  for (const uri of pluginExtensionUris.values()) {
-    roots.set(getGraphViewUriKey(uri), uri);
-  }
-
-  for (const folder of workspaceFolders ?? []) {
-    roots.set(getGraphViewUriKey(folder.uri), folder.uri);
-  }
-
-  return [...roots.values()];
-}
+): vscode.Uri[] {}
 
killedBy: graphView/resourceRoots getGraphViewLocalResourceRoots includes the extension root
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/extension/graphView/resourceRoots.ts:20:51
   const roots = new Map<string, vscode.Uri>();
   roots.set(getGraphViewUriKey(extensionUri), extensionUri);
 
-  for (const uri of pluginExtensionUris.values()) {
-    roots.set(getGraphViewUriKey(uri), uri);
-  }
+  for (const uri of pluginExtensionUris.values()) {}
 
   for (const folder of workspaceFolders ?? []) {
killedBy: graphViewResources deduplicates extension, plugin, and workspace resource roots
statusReason: expected [ Array(2) ] to deeply equal [ '/test/extension', …(2) ]

[Killed] LogicalOperator
src/extension/graphView/resourceRoots.ts:24:24
     roots.set(getGraphViewUriKey(uri), uri);
   }
 
-  for (const folder of workspaceFolders ?? []) {
+  for (const folder of workspaceFolders && []) {
     roots.set(getGraphViewUriKey(folder.uri), folder.uri);
   }
killedBy: graphViewResources deduplicates extension, plugin, and workspace resource roots; graphView/resourceRoots getGraphViewLocalResourceRoots includes the extension root; graphView/webview/plugins/resources returns the combined local resource roots for extension, plugin, and workspace folders
statusReason: expected [ '/test/extension', …(1) ] to deeply equal [ '/test/extension', …(2) ]

[Killed] BlockStatement
src/extension/graphView/resourceRoots.ts:24:48
     roots.set(getGraphViewUriKey(uri), uri);
   }
 
-  for (const folder of workspaceFolders ?? []) {
-    roots.set(getGraphViewUriKey(folder.uri), folder.uri);
-  }
+  for (const folder of workspaceFolders ?? []) {}
 
   return [...roots.values()];
killedBy: graphViewResources deduplicates extension, plugin, and workspace resource roots
statusReason: expected [ '/test/extension', …(1) ] to deeply equal [ '/test/extension', …(2) ]

[Killed] ArrayDeclaration
src/extension/graphView/resourceRoots.ts:28:10
     roots.set(getGraphViewUriKey(folder.uri), folder.uri);
   }
 
-  return [...roots.values()];
+  return [];
 }
 
killedBy: graphViewResources deduplicates extension, plugin, and workspace resource roots; graphView/resourceRoots getGraphViewLocalResourceRoots includes the extension root
statusReason: expected [] to deeply equal [ '/test/extension', …(2) ]
