[Killed] LogicalOperator
src/extension/pipeline/fileAnalysis.ts:72:9
     const cached = cache.files[file.relativePath];
     const stat = await getFileStat(file.absolutePath);
 
-    if (cached && cached.mtime === stat?.mtime) {
+    if (cached || cached.mtime === stat?.mtime) {
       if (cached.size === undefined && stat?.size !== undefined) {
         cached.size = stat.size;
killedBy: pipeline/fileAnalysis analyzes uncached files and stores the new cache entry
statusReason: Cannot read properties of undefined (reading 'mtime')

[Killed] OptionalChaining
src/extension/pipeline/fileAnalysis.ts:72:36
     const cached = cache.files[file.relativePath];
     const stat = await getFileStat(file.absolutePath);
 
-    if (cached && cached.mtime === stat?.mtime) {
+    if (cached && cached.mtime === stat.mtime) {
       if (cached.size === undefined && stat?.size !== undefined) {
         cached.size = stat.size;
killedBy: pipeline/fileAnalysis treats cached entries as misses when file stats are unavailable
statusReason: Cannot read properties of null (reading 'mtime')

[Killed] ConditionalExpression
src/extension/pipeline/fileAnalysis.ts:73:11
     const stat = await getFileStat(file.absolutePath);
 
     if (cached && cached.mtime === stat?.mtime) {
-      if (cached.size === undefined && stat?.size !== undefined) {
+      if (true) {
         cached.size = stat.size;
       }
killedBy: pipeline/fileAnalysis keeps the cached size when a cache hit already has size data
statusReason: expected 99 to be 12 // Object.is equality

[Killed] ConditionalExpression
src/extension/pipeline/fileAnalysis.ts:73:11
     const stat = await getFileStat(file.absolutePath);
 
     if (cached && cached.mtime === stat?.mtime) {
-      if (cached.size === undefined && stat?.size !== undefined) {
+      if (true && stat?.size !== undefined) {
         cached.size = stat.size;
       }
killedBy: pipeline/fileAnalysis keeps the cached size when a cache hit already has size data
statusReason: expected 99 to be 12 // Object.is equality

[Killed] AssignmentOperator
src/extension/pipeline/fileAnalysis.ts:82:7
         file.relativePath,
         projectProjectedConnectionsFromFileAnalysis(cached.analysis),
       );
-      cacheHits += 1;
+      cacheHits -= 1;
       options.onProgress?.({
         current: cacheHits + cacheMisses,
killedBy: pipeline/fileAnalysis reuses cached connections and backfills missing size on cache hits
statusReason: expected -1 to be 1 // Object.is equality

[Killed] OptionalChaining
src/extension/pipeline/fileAnalysis.ts:83:7
         projectProjectedConnectionsFromFileAnalysis(cached.analysis),
       );
       cacheHits += 1;
-      options.onProgress?.({
-        current: cacheHits + cacheMisses,
-        total: files.length,
-        filePath: file.relativePath,
-      });
+      options.onProgress({
+  current: cacheHits + cacheMisses,
+  total: files.length,
+  filePath: file.relativePath
+});
       continue;
     }
killedBy: pipeline/fileAnalysis keeps the cached size when a cache hit already has size data
statusReason: options.onProgress is not a function

[Survived] ArithmeticOperator
src/extension/pipeline/fileAnalysis.ts:84:18
       );
       cacheHits += 1;
       options.onProgress?.({
-        current: cacheHits + cacheMisses,
+        current: cacheHits - cacheMisses,
         total: files.length,
         filePath: file.relativePath,

[Killed] AssignmentOperator
src/extension/pipeline/fileAnalysis.ts:91:5
       continue;
     }
 
-    cacheMisses += 1;
+    cacheMisses -= 1;
     throwIfWorkspaceAnalysisAborted(signal);
     const content = await readContent(file);
killedBy: pipeline/fileAnalysis analyzes uncached files and stores the new cache entry
statusReason: expected -1 to be 1 // Object.is equality

[Killed] OptionalChaining
src/extension/pipeline/fileAnalysis.ts:100:5
 
     fileAnalysis.set(file.relativePath, analysis);
     fileConnections.set(file.relativePath, connections);
-    emitFileProcessed?.({
-      filePath: file.relativePath,
-      connections: connections.map((connection) => ({
-        specifier: connection.specifier,
-        resolvedPath: connection.resolvedPath,
-      })),
-    });
+    emitFileProcessed({
+  filePath: file.relativePath,
+  connections: connections.map(connection => ({
+    specifier: connection.specifier,
+    resolvedPath: connection.resolvedPath
+  }))
+});
     options.onProgress?.({
       current: cacheHits + cacheMisses,
killedBy: pipeline/fileAnalysis analyzes uncached files and stores the new cache entry
statusReason: emitFileProcessed is not a function

[Killed] ArrowFunction
src/extension/pipeline/fileAnalysis.ts:102:36
     fileConnections.set(file.relativePath, connections);
     emitFileProcessed?.({
       filePath: file.relativePath,
-      connections: connections.map((connection) => ({
-        specifier: connection.specifier,
-        resolvedPath: connection.resolvedPath,
-      })),
+      connections: connections.map(() => undefined),
     });
     options.onProgress?.({
killedBy: pipeline/fileAnalysis emits file processed payloads for analyzed files
statusReason: expected "spy" to be called with arguments: [ { filePath: 'src/index.ts', …(1) } ]

Received: 

  1st spy call:

  [
    {

[Killed] OptionalChaining
src/extension/pipeline/fileAnalysis.ts:107:5
         resolvedPath: connection.resolvedPath,
       })),
     });
-    options.onProgress?.({
-      current: cacheHits + cacheMisses,
-      total: files.length,
-      filePath: file.relativePath,
-    });
+    options.onProgress({
+  current: cacheHits + cacheMisses,
+  total: files.length,
+  filePath: file.relativePath
+});
 
     cache.files[file.relativePath] = {
killedBy: pipeline/fileAnalysis treats stale cached entries as cache misses
statusReason: options.onProgress is not a function

[Killed] ObjectLiteral
src/extension/pipeline/fileAnalysis.ts:113:38
       filePath: file.relativePath,
     });
 
-    cache.files[file.relativePath] = {
-      mtime: stat?.mtime ?? 0,
-      analysis,
-      size: stat?.size,
-    };
+    cache.files[file.relativePath] = {};
   }
 
killedBy: pipeline/fileAnalysis analyzes uncached files and stores the new cache entry
statusReason: expected {} to deeply equal { mtime: 50, analysis: { …(2) }, …(1) }

[Killed] LogicalOperator
src/extension/pipeline/fileAnalysis.ts:114:14
     });
 
     cache.files[file.relativePath] = {
-      mtime: stat?.mtime ?? 0,
+      mtime: stat?.mtime && 0,
       analysis,
       size: stat?.size,
killedBy: pipeline/fileAnalysis analyzes uncached files and stores the new cache entry
statusReason: expected { mtime: +0, analysis: { …(2) }, …(1) } to deeply equal { mtime: 50, analysis: { …(2) }, …(1) }

[Killed] OptionalChaining
src/extension/pipeline/fileAnalysis.ts:114:14
     });
 
     cache.files[file.relativePath] = {
-      mtime: stat?.mtime ?? 0,
+      mtime: stat.mtime ?? 0,
       analysis,
       size: stat?.size,
killedBy: pipeline/fileAnalysis stores zero mtime when file stats are unavailable
statusReason: Cannot read properties of null (reading 'mtime')

[Killed] OptionalChaining
src/extension/pipeline/fileAnalysis.ts:116:13
     cache.files[file.relativePath] = {
       mtime: stat?.mtime ?? 0,
       analysis,
-      size: stat?.size,
+      size: stat.size,
     };
   }
killedBy: pipeline/fileAnalysis stores zero mtime when file stats are unavailable
statusReason: Cannot read properties of null (reading 'size')

[Killed] ObjectLiteral
src/extension/pipeline/fileAnalysis.ts:120:10
     };
   }
 
-  return {
-    cacheHits,
-    cacheMisses,
-    fileAnalysis,
-    fileConnections,
-  };
+  return {};
 }
 
killedBy: pipeline/fileAnalysis reuses cached connections and backfills missing size on cache hits
statusReason: expected undefined to be 1 // Object.is equality
