[Killed] BlockStatement
src/extension/pipeline/projection.ts:5:27
 
 export function projectProjectedConnectionsFromFileAnalysis(
   analysis: IFileAnalysisResult,
-): IProjectedConnection[] {
-  return (analysis.relations ?? []).map(relation => ({
-    kind: relation.kind,
-    pluginId: relation.pluginId,
-    sourceId: relation.sourceId,
-    specifier: relation.specifier ?? '',
-    resolvedPath: relation.resolvedPath ?? relation.toFilePath ?? null,
-    type: relation.type,
-    variant: relation.variant,
-    metadata: relation.metadata,
-  }));
-}
+): IProjectedConnection[] {}
 
 export function projectConnectionMapFromFileAnalysis(
killedBy: pipeline/fileAnalysis reuses cached connections and backfills missing size on cache hits; extension/pipeline/projection projects file analysis relations into projected connections with normalized defaults
statusReason: expected undefined to deeply equal [ { specifier: './utils', …(4) } ]

[Killed] LogicalOperator
src/extension/pipeline/projection.ts:6:11
 export function projectProjectedConnectionsFromFileAnalysis(
   analysis: IFileAnalysisResult,
 ): IProjectedConnection[] {
-  return (analysis.relations ?? []).map(relation => ({
+  return (analysis.relations && []).map(relation => ({
     kind: relation.kind,
     pluginId: relation.pluginId,
killedBy: extension/pipeline/projection projects file analysis relations into projected connections with normalized defaults
statusReason: expected [] to deeply equal [ { kind: 'import', …(7) }, …(1) ]

[Killed] ArrowFunction
src/extension/pipeline/projection.ts:6:41
 export function projectProjectedConnectionsFromFileAnalysis(
   analysis: IFileAnalysisResult,
 ): IProjectedConnection[] {
-  return (analysis.relations ?? []).map(relation => ({
-    kind: relation.kind,
-    pluginId: relation.pluginId,
-    sourceId: relation.sourceId,
-    specifier: relation.specifier ?? '',
-    resolvedPath: relation.resolvedPath ?? relation.toFilePath ?? null,
-    type: relation.type,
-    variant: relation.variant,
-    metadata: relation.metadata,
-  }));
+  return (analysis.relations ?? []).map(() => undefined);
 }
 
killedBy: extension/pipeline/projection projects file analysis relations into projected connections with normalized defaults; pipeline/fileAnalysis reuses cached connections and backfills missing size on cache hits
statusReason: expected [ undefined, undefined ] to deeply equal [ { kind: 'import', …(7) }, …(1) ]

[Killed] LogicalOperator
src/extension/pipeline/projection.ts:10:16
     kind: relation.kind,
     pluginId: relation.pluginId,
     sourceId: relation.sourceId,
-    specifier: relation.specifier ?? '',
+    specifier: relation.specifier && '',
     resolvedPath: relation.resolvedPath ?? relation.toFilePath ?? null,
     type: relation.type,
killedBy: pipeline/fileAnalysis reuses cached connections and backfills missing size on cache hits
statusReason: expected [ { kind: 'import', …(7) } ] to deeply equal [ { specifier: './utils', …(4) } ]

[Killed] LogicalOperator
src/extension/pipeline/projection.ts:11:19
     pluginId: relation.pluginId,
     sourceId: relation.sourceId,
     specifier: relation.specifier ?? '',
-    resolvedPath: relation.resolvedPath ?? relation.toFilePath ?? null,
+    resolvedPath: (relation.resolvedPath ?? relation.toFilePath) && null,
     type: relation.type,
     variant: relation.variant,
killedBy: extension/pipeline/projection projects file analysis relations into projected connections with normalized defaults
statusReason: expected [ { kind: 'import', …(7) }, …(1) ] to deeply equal [ { kind: 'import', …(7) }, …(1) ]

[Killed] LogicalOperator
src/extension/pipeline/projection.ts:11:19
     pluginId: relation.pluginId,
     sourceId: relation.sourceId,
     specifier: relation.specifier ?? '',
-    resolvedPath: relation.resolvedPath ?? relation.toFilePath ?? null,
+    resolvedPath: relation.resolvedPath && relation.toFilePath ?? null,
     type: relation.type,
     variant: relation.variant,
killedBy: extension/pipeline/projection projects file analysis relations into projected connections with normalized defaults
statusReason: expected [ { kind: 'import', …(7) }, …(1) ] to deeply equal [ { kind: 'import', …(7) }, …(1) ]

[Killed] BlockStatement
src/extension/pipeline/projection.ts:20:40
 
 export function projectConnectionMapFromFileAnalysis(
   fileAnalysis: ReadonlyMap<string, IFileAnalysisResult>,
-): Map<string, IProjectedConnection[]> {
-  return new Map(
-    Array.from(fileAnalysis.entries()).map(([filePath, analysis]) => [
-      filePath,
-      projectProjectedConnectionsFromFileAnalysis(analysis),
-    ]),
-  );
-}
+): Map<string, IProjectedConnection[]> {}
 
killedBy: extension/pipeline/projection projects a file analysis map entry by entry
statusReason: expected undefined to deeply equal Map{ …(2) }

[Killed] ArrowFunction
src/extension/pipeline/projection.ts:22:44
   fileAnalysis: ReadonlyMap<string, IFileAnalysisResult>,
 ): Map<string, IProjectedConnection[]> {
   return new Map(
-    Array.from(fileAnalysis.entries()).map(([filePath, analysis]) => [
-      filePath,
-      projectProjectedConnectionsFromFileAnalysis(analysis),
-    ]),
+    Array.from(fileAnalysis.entries()).map(() => undefined),
   );
 }
killedBy: extension/pipeline/projection projects a file analysis map entry by entry
statusReason: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
src/extension/pipeline/projection.ts:22:70
   fileAnalysis: ReadonlyMap<string, IFileAnalysisResult>,
 ): Map<string, IProjectedConnection[]> {
   return new Map(
-    Array.from(fileAnalysis.entries()).map(([filePath, analysis]) => [
-      filePath,
-      projectProjectedConnectionsFromFileAnalysis(analysis),
-    ]),
+    Array.from(fileAnalysis.entries()).map(([filePath, analysis]) => []),
   );
 }
killedBy: extension/pipeline/projection projects a file analysis map entry by entry
statusReason: expected Map{ undefined => undefined } to deeply equal Map{ …(2) }
