[Killed] BlockStatement
src/extension/repoSettings/store.ts:51:5
 
   constructor(
     private readonly _workspaceRoot: string,
-  ) {
-    this._settingsDirectoryPath = path.join(_workspaceRoot, SETTINGS_DIR_NAME);
-    this._settingsPath = path.join(this._settingsDirectoryPath, SETTINGS_FILE_NAME);
-    this._gitIgnorePath = path.join(_workspaceRoot, '.gitignore');
-
-    fs.mkdirSync(this._settingsDirectoryPath, { recursive: true });
-    ensureGitIgnoreContainsCodeGraphyEntry(this._gitIgnorePath);
-
-    if (fs.existsSync(this._settingsPath)) {
-      const nextState = readSettingsFromDisk(this._settingsPath, this._defaults);
-      this._settings = nextState.settings;
-      this._serializedSettings = nextState.serializedSettings;
-    } else {
-      this._settings = createDefaultCodeGraphyRepoSettings();
-      this._serializedSettings = writeSettingsToDisk(this._settingsPath, this._settings);
-    }
-  }
+  ) {}
 
   get workspaceRoot(): string {
killedBy: extension/repoSettings/store creates .codegraphy/settings.json from defaults instead of seeding legacy configuration
statusReason: ENOENT: no such file or directory, open '/var/folders/09/m1sgrczj11d5v3_0bmmkw9gm0000gp/T/codegraphy-settings-VdncrC/.codegraphy/settings.json'

[Killed] StringLiteral
src/extension/repoSettings/store.ts:54:53
   ) {
     this._settingsDirectoryPath = path.join(_workspaceRoot, SETTINGS_DIR_NAME);
     this._settingsPath = path.join(this._settingsDirectoryPath, SETTINGS_FILE_NAME);
-    this._gitIgnorePath = path.join(_workspaceRoot, '.gitignore');
+    this._gitIgnorePath = path.join(_workspaceRoot, "");
 
     fs.mkdirSync(this._settingsDirectoryPath, { recursive: true });
killedBy: extension/repoSettings/store creates .codegraphy/settings.json from defaults instead of seeding legacy configuration
statusReason: EISDIR: illegal operation on a directory, read

[Killed] BooleanLiteral
src/extension/repoSettings/store.ts:56:60
     this._settingsPath = path.join(this._settingsDirectoryPath, SETTINGS_FILE_NAME);
     this._gitIgnorePath = path.join(_workspaceRoot, '.gitignore');
 
-    fs.mkdirSync(this._settingsDirectoryPath, { recursive: true });
+    fs.mkdirSync(this._settingsDirectoryPath, { recursive: false });
     ensureGitIgnoreContainsCodeGraphyEntry(this._gitIgnorePath);
 
killedBy: extension/repoSettings/store creates .gitignore when missing and adds .codegraphy/ once
statusReason: EEXIST: file already exists, mkdir '/var/folders/09/m1sgrczj11d5v3_0bmmkw9gm0000gp/T/codegraphy-settings-OHBfTC/.codegraphy'

[Killed] ObjectLiteral
src/extension/repoSettings/store.ts:56:47
     this._settingsPath = path.join(this._settingsDirectoryPath, SETTINGS_FILE_NAME);
     this._gitIgnorePath = path.join(_workspaceRoot, '.gitignore');
 
-    fs.mkdirSync(this._settingsDirectoryPath, { recursive: true });
+    fs.mkdirSync(this._settingsDirectoryPath, {});
     ensureGitIgnoreContainsCodeGraphyEntry(this._gitIgnorePath);
 
killedBy: extension/repoSettings/store creates .gitignore when missing and adds .codegraphy/ once
statusReason: EEXIST: file already exists, mkdir '/var/folders/09/m1sgrczj11d5v3_0bmmkw9gm0000gp/T/codegraphy-settings-yqtNPm/.codegraphy'

[Killed] ConditionalExpression
src/extension/repoSettings/store.ts:59:9
     fs.mkdirSync(this._settingsDirectoryPath, { recursive: true });
     ensureGitIgnoreContainsCodeGraphyEntry(this._gitIgnorePath);
 
-    if (fs.existsSync(this._settingsPath)) {
+    if (false) {
       const nextState = readSettingsFromDisk(this._settingsPath, this._defaults);
       this._settings = nextState.settings;
killedBy: extension/repoSettings/store reads persisted legend and node colors without legacy key aliases
statusReason: expected [] to deeply equal [ { id: 'legend-rule', …(2) } ]

[Killed] BlockStatement
src/extension/repoSettings/store.ts:59:44
     fs.mkdirSync(this._settingsDirectoryPath, { recursive: true });
     ensureGitIgnoreContainsCodeGraphyEntry(this._gitIgnorePath);
 
-    if (fs.existsSync(this._settingsPath)) {
-      const nextState = readSettingsFromDisk(this._settingsPath, this._defaults);
-      this._settings = nextState.settings;
-      this._serializedSettings = nextState.serializedSettings;
-    } else {
+    if (fs.existsSync(this._settingsPath)) {} else {
       this._settings = createDefaultCodeGraphyRepoSettings();
       this._serializedSettings = writeSettingsToDisk(this._settingsPath, this._settings);
killedBy: extension/repoSettings/store reads persisted legend and node colors without legacy key aliases
statusReason: expected [] to deeply equal [ { id: 'legend-rule', …(2) } ]

[Killed] BlockStatement
src/extension/repoSettings/store.ts:63:12
       const nextState = readSettingsFromDisk(this._settingsPath, this._defaults);
       this._settings = nextState.settings;
       this._serializedSettings = nextState.serializedSettings;
-    } else {
-      this._settings = createDefaultCodeGraphyRepoSettings();
-      this._serializedSettings = writeSettingsToDisk(this._settingsPath, this._settings);
-    }
+    } else {}
   }
 
killedBy: extension/repoSettings/store creates .codegraphy/settings.json from defaults instead of seeding legacy configuration
statusReason: ENOENT: no such file or directory, open '/var/folders/09/m1sgrczj11d5v3_0bmmkw9gm0000gp/T/codegraphy-settings-WfICey/.codegraphy/settings.json'

[Killed] BlockStatement
src/extension/repoSettings/store.ts:69:31
     }
   }
 
-  get workspaceRoot(): string {
-    return this._workspaceRoot;
-  }
+  get workspaceRoot(): string {}
 
   get settingsPath(): string {
killedBy: extension/repoSettings/store creates .codegraphy/settings.json from defaults instead of seeding legacy configuration
statusReason: expected undefined to be '/var/folders/09/m1sgrczj11d5v3_0bmmkw…' // Object.is equality

[Killed] BlockStatement
src/extension/repoSettings/store.ts:73:30
     return this._workspaceRoot;
   }
 
-  get settingsPath(): string {
-    return this._settingsPath;
-  }
+  get settingsPath(): string {}
 
   get<T>(key: string, defaultValue: T): T {
killedBy: extension/repoSettings/store creates .codegraphy/settings.json from defaults instead of seeding legacy configuration
statusReason: expected undefined to be '/var/folders/09/m1sgrczj11d5v3_0bmmkw…' // Object.is equality

[Killed] BlockStatement
src/extension/repoSettings/store.ts:77:43
     return this._settingsPath;
   }
 
-  get<T>(key: string, defaultValue: T): T {
-    const value = getNestedValue<T>(this._settings, key);
-    return value ?? defaultValue;
-  }
+  get<T>(key: string, defaultValue: T): T {}
 
   inspect<T>(key: string): ICodeGraphySettingsInspect<T> {
killedBy: extension/repoSettings/store creates .codegraphy/settings.json from defaults instead of seeding legacy configuration
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/extension/repoSettings/store.ts:79:12
 
   get<T>(key: string, defaultValue: T): T {
     const value = getNestedValue<T>(this._settings, key);
-    return value ?? defaultValue;
+    return value && defaultValue;
   }
 
killedBy: extension/repoSettings/store creates .codegraphy/settings.json from defaults instead of seeding legacy configuration
statusReason: expected +0 to be 500 // Object.is equality

[Killed] BlockStatement
src/extension/repoSettings/store.ts:82:58
     return value ?? defaultValue;
   }
 
-  inspect<T>(key: string): ICodeGraphySettingsInspect<T> {
-    return {
-      defaultValue: getNestedValue<T>(this._defaults, key),
-      workspaceValue: hasNestedValue(this._settings, key)
-        ? getNestedValue<T>(this._settings, key)
-        : undefined,
-    };
-  }
+  inspect<T>(key: string): ICodeGraphySettingsInspect<T> {}
 
   async update(key: string, value: unknown): Promise<void> {
killedBy: extension/repoSettings/store inspects default and workspace values for nested keys
statusReason: expected undefined to deeply equal { defaultValue: 1, workspaceValue: 1 }

[Killed] ObjectLiteral
src/extension/repoSettings/store.ts:83:12
   }
 
   inspect<T>(key: string): ICodeGraphySettingsInspect<T> {
-    return {
-      defaultValue: getNestedValue<T>(this._defaults, key),
-      workspaceValue: hasNestedValue(this._settings, key)
-        ? getNestedValue<T>(this._settings, key)
-        : undefined,
-    };
+    return {};
   }
 
killedBy: extension/repoSettings/store inspects default and workspace values for nested keys
statusReason: expected {} to deeply equal { defaultValue: 1, workspaceValue: 1 }

[Killed] BlockStatement
src/extension/repoSettings/store.ts:91:60
     };
   }
 
-  async update(key: string, value: unknown): Promise<void> {
-    this._settings = createUpdatedSettings(this._defaults, this._settings, key, value);
-    this._serializedSettings = writeSettingsToDisk(this._settingsPath, this._settings);
-    this._emit([key]);
-  }
+  async update(key: string, value: unknown): Promise<void> {}
 
   async updateSilently(key: string, value: unknown): Promise<void> {
killedBy: extension/repoSettings/store updates nested settings keys and persists the result
statusReason: expected 1 to be 2.5 // Object.is equality

[Killed] ArrayDeclaration
src/extension/repoSettings/store.ts:94:16
   async update(key: string, value: unknown): Promise<void> {
     this._settings = createUpdatedSettings(this._defaults, this._settings, key, value);
     this._serializedSettings = writeSettingsToDisk(this._settingsPath, this._settings);
-    this._emit([key]);
+    this._emit([]);
   }
 
killedBy: extension/repoSettings/store reports alias and parent-child matches through affectsConfiguration
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/extension/repoSettings/store.ts:97:68
     this._emit([key]);
   }
 
-  async updateSilently(key: string, value: unknown): Promise<void> {
-    this._settings = createUpdatedSettings(this._defaults, this._settings, key, value);
-    this._serializedSettings = writeSettingsToDisk(this._settingsPath, this._settings);
-  }
+  async updateSilently(key: string, value: unknown): Promise<void> {}
 
   onDidChange(
killedBy: extension/repoSettings/store persists silent updates without emitting a change event
statusReason: expected [] to deeply equal [ 'codegraphy.python' ]

[Killed] BlockStatement
src/extension/repoSettings/store.ts:104:26
 
   onDidChange(
     listener: (event: ICodeGraphySettingsChangeEvent) => void,
-  ): { dispose(): void } {
-    this._listeners.add(listener);
-    return {
-      dispose: () => {
-        this._listeners.delete(listener);
-      },
-    };
-  }
+  ): { dispose(): void } {}
 
   reload(): void {
killedBy: extension/repoSettings/store reloads manual file edits and emits a change event
statusReason: expected [] to deeply equal [ [ 'maxFiles' ] ]

[Killed] BlockStatement
src/extension/repoSettings/store.ts:107:22
   ): { dispose(): void } {
     this._listeners.add(listener);
     return {
-      dispose: () => {
-        this._listeners.delete(listener);
-      },
+      dispose: () => {},
     };
   }
killedBy: extension/repoSettings/store stops notifying a listener after it is disposed
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] BlockStatement
src/extension/repoSettings/store.ts:113:18
     };
   }
 
-  reload(): void {
-    const nextState = reloadSettingsFromDisk(
-      this._settingsPath,
-      this._defaults,
-      this._settings,
-      this._serializedSettings,
-    );
-    if (!nextState) {
-      return;
-    }
-
-    this._settings = nextState.settings;
-    this._serializedSettings = nextState.serializedSettings;
-    this._emit(nextState.changedKeys);
-  }
+  reload(): void {}
 
   private _emit(changedKeys: string[]): void {
killedBy: extension/repoSettings/store reloads manual file edits and emits a change event
statusReason: expected 500 to be 900 // Object.is equality

[Killed] ConditionalExpression
src/extension/repoSettings/store.ts:120:9
       this._settings,
       this._serializedSettings,
     );
-    if (!nextState) {
+    if (false) {
       return;
     }
killedBy: extension/repoSettings/store ignores invalid manual saves and keeps the last valid settings in memory
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BooleanLiteral
src/extension/repoSettings/store.ts:120:9
       this._settings,
       this._serializedSettings,
     );
-    if (!nextState) {
+    if (nextState) {
       return;
     }
killedBy: extension/repoSettings/store reloads manual file edits and emits a change event
statusReason: expected 500 to be 900 // Object.is equality

[Killed] BlockStatement
src/extension/repoSettings/store.ts:129:46
     this._emit(nextState.changedKeys);
   }
 
-  private _emit(changedKeys: string[]): void {
-    const event = createChangeEvent(changedKeys);
-    for (const listener of this._listeners) {
-      listener(event);
-    }
-  }
+  private _emit(changedKeys: string[]): void {}
 }
 
killedBy: extension/repoSettings/store reloads manual file edits and emits a change event
statusReason: expected [] to deeply equal [ [ 'maxFiles' ] ]

[Killed] BlockStatement
src/extension/repoSettings/store.ts:131:45
 
   private _emit(changedKeys: string[]): void {
     const event = createChangeEvent(changedKeys);
-    for (const listener of this._listeners) {
-      listener(event);
-    }
+    for (const listener of this._listeners) {}
   }
 }
killedBy: extension/repoSettings/store reloads manual file edits and emits a change event
statusReason: expected [] to deeply equal [ [ 'maxFiles' ] ]
