[Killed] BlockStatement
src/webview/app/PanelStack.tsx:25:41
   hasGraphNodes,
   pluginHost,
   onClosePanel,
-}: PanelStackProps): React.ReactElement {
-  return (
-    <div className="absolute top-2 bottom-2 right-2 z-10 flex flex-col justify-end pointer-events-none [&>*]:pointer-events-auto">
-      <SlotHost
-        pluginHost={pluginHost}
-        slot="node-details"
-        data-testid="node-details-slot"
-        className="bg-popover/95 backdrop-blur-sm rounded-lg border w-72 shadow-lg max-h-full flex flex-col overflow-hidden mb-2"
-      />
-      <NodesPanel isOpen={activePanel === 'nodes'} onClose={onClosePanel} />
-      <EdgesPanel isOpen={activePanel === 'edges'} onClose={onClosePanel} />
-      <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
-      <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
-      <PluginsPanel isOpen={activePanel === 'plugins'} onClose={onClosePanel} />
-      <SettingsPanel isOpen={activePanel === 'settings'} onClose={onClosePanel} />
-      {hasGraphNodes && activePanel === 'none' ? (
-        <div className="mt-2 self-end">
-          <GraphCornerControls />
-        </div>
-      ) : null}
-    </div>
-  );
-}
+}: PanelStackProps): React.ReactElement {}
 
killedBy: app/PanelStack renders the requested panel and keeps the node details slot mounted
statusReason: Unable to find an element by: [data-testid="node-details-slot"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] EqualityOperator
src/webview/app/PanelStack.tsx:34:27
         data-testid="node-details-slot"
         className="bg-popover/95 backdrop-blur-sm rounded-lg border w-72 shadow-lg max-h-full flex flex-col overflow-hidden mb-2"
       />
-      <NodesPanel isOpen={activePanel === 'nodes'} onClose={onClosePanel} />
+      <NodesPanel isOpen={activePanel !== 'nodes'} onClose={onClosePanel} />
       <EdgesPanel isOpen={activePanel === 'edges'} onClose={onClosePanel} />
       <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
killedBy: app/PanelStack renders the nodes panel when it is active
statusReason: Unable to find an element by: [data-testid="nodes-panel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="absolute top-2 bottom-2 right-2 z-10 flex flex-col justify-end pointer-events-none [&>*]:pointer-events-auto"
    >

[Killed] ConditionalExpression
src/webview/app/PanelStack.tsx:34:27
         data-testid="node-details-slot"
         className="bg-popover/95 backdrop-blur-sm rounded-lg border w-72 shadow-lg max-h-full flex flex-col overflow-hidden mb-2"
       />
-      <NodesPanel isOpen={activePanel === 'nodes'} onClose={onClosePanel} />
+      <NodesPanel isOpen={false} onClose={onClosePanel} />
       <EdgesPanel isOpen={activePanel === 'edges'} onClose={onClosePanel} />
       <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
killedBy: app/PanelStack renders the nodes panel when it is active
statusReason: Unable to find an element by: [data-testid="nodes-panel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="absolute top-2 bottom-2 right-2 z-10 flex flex-col justify-end pointer-events-none [&>*]:pointer-events-auto"
    >

[Killed] EqualityOperator
src/webview/app/PanelStack.tsx:35:27
         className="bg-popover/95 backdrop-blur-sm rounded-lg border w-72 shadow-lg max-h-full flex flex-col overflow-hidden mb-2"
       />
       <NodesPanel isOpen={activePanel === 'nodes'} onClose={onClosePanel} />
-      <EdgesPanel isOpen={activePanel === 'edges'} onClose={onClosePanel} />
+      <EdgesPanel isOpen={activePanel !== 'edges'} onClose={onClosePanel} />
       <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
       <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
killedBy: app/PanelStack renders the edges panel when it is active
statusReason: Unable to find an element by: [data-testid="edges-panel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="absolute top-2 bottom-2 right-2 z-10 flex flex-col justify-end pointer-events-none [&>*]:pointer-events-auto"
    >

[Killed] ConditionalExpression
src/webview/app/PanelStack.tsx:35:27
         className="bg-popover/95 backdrop-blur-sm rounded-lg border w-72 shadow-lg max-h-full flex flex-col overflow-hidden mb-2"
       />
       <NodesPanel isOpen={activePanel === 'nodes'} onClose={onClosePanel} />
-      <EdgesPanel isOpen={activePanel === 'edges'} onClose={onClosePanel} />
+      <EdgesPanel isOpen={false} onClose={onClosePanel} />
       <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
       <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
killedBy: app/PanelStack renders the edges panel when it is active
statusReason: Unable to find an element by: [data-testid="edges-panel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="absolute top-2 bottom-2 right-2 z-10 flex flex-col justify-end pointer-events-none [&>*]:pointer-events-auto"
    >

[Killed] ConditionalExpression
src/webview/app/PanelStack.tsx:36:29
       />
       <NodesPanel isOpen={activePanel === 'nodes'} onClose={onClosePanel} />
       <EdgesPanel isOpen={activePanel === 'edges'} onClose={onClosePanel} />
-      <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
+      <LegendsPanel isOpen={true} onClose={onClosePanel} />
       <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
       <PluginsPanel isOpen={activePanel === 'plugins'} onClose={onClosePanel} />
killedBy: App should hide graph corner controls while a right-side popup is open
statusReason: Found multiple elements with the text: Edges

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="text-sm font-medium"
>

[Killed] EqualityOperator
src/webview/app/PanelStack.tsx:36:29
       />
       <NodesPanel isOpen={activePanel === 'nodes'} onClose={onClosePanel} />
       <EdgesPanel isOpen={activePanel === 'edges'} onClose={onClosePanel} />
-      <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
+      <LegendsPanel isOpen={activePanel !== 'legends'} onClose={onClosePanel} />
       <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
       <PluginsPanel isOpen={activePanel === 'plugins'} onClose={onClosePanel} />
killedBy: app/PanelStack renders the legends panel when it is active
statusReason: Unable to find an element by: [data-testid="legends-panel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="absolute top-2 bottom-2 right-2 z-10 flex flex-col justify-end pointer-events-none [&>*]:pointer-events-auto"
    >

[Killed] EqualityOperator
src/webview/app/PanelStack.tsx:37:28
       <NodesPanel isOpen={activePanel === 'nodes'} onClose={onClosePanel} />
       <EdgesPanel isOpen={activePanel === 'edges'} onClose={onClosePanel} />
       <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
-      <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
+      <ExportPanel isOpen={activePanel !== 'export'} onClose={onClosePanel} />
       <PluginsPanel isOpen={activePanel === 'plugins'} onClose={onClosePanel} />
       <SettingsPanel isOpen={activePanel === 'settings'} onClose={onClosePanel} />
killedBy: app/PanelStack renders the export panel when it is active
statusReason: Unable to find an element by: [data-testid="export-panel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="absolute top-2 bottom-2 right-2 z-10 flex flex-col justify-end pointer-events-none [&>*]:pointer-events-auto"
    >

[Killed] ConditionalExpression
src/webview/app/PanelStack.tsx:37:28
       <NodesPanel isOpen={activePanel === 'nodes'} onClose={onClosePanel} />
       <EdgesPanel isOpen={activePanel === 'edges'} onClose={onClosePanel} />
       <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
-      <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
+      <ExportPanel isOpen={false} onClose={onClosePanel} />
       <PluginsPanel isOpen={activePanel === 'plugins'} onClose={onClosePanel} />
       <SettingsPanel isOpen={activePanel === 'settings'} onClose={onClosePanel} />
killedBy: app/PanelStack renders the export panel when it is active
statusReason: Unable to find an element by: [data-testid="export-panel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="absolute top-2 bottom-2 right-2 z-10 flex flex-col justify-end pointer-events-none [&>*]:pointer-events-auto"
    >

[Killed] ConditionalExpression
src/webview/app/PanelStack.tsx:38:29
       <EdgesPanel isOpen={activePanel === 'edges'} onClose={onClosePanel} />
       <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
       <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
-      <PluginsPanel isOpen={activePanel === 'plugins'} onClose={onClosePanel} />
+      <PluginsPanel isOpen={true} onClose={onClosePanel} />
       <SettingsPanel isOpen={activePanel === 'settings'} onClose={onClosePanel} />
       {hasGraphNodes && activePanel === 'none' ? (
killedBy: App (mutation targets) renders toolbar when activePanel is none
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  data-testid="plugins-panel"
>
  Close Plugins
</button> instead

[Killed] EqualityOperator
src/webview/app/PanelStack.tsx:38:29
       <EdgesPanel isOpen={activePanel === 'edges'} onClose={onClosePanel} />
       <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
       <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
-      <PluginsPanel isOpen={activePanel === 'plugins'} onClose={onClosePanel} />
+      <PluginsPanel isOpen={activePanel !== 'plugins'} onClose={onClosePanel} />
       <SettingsPanel isOpen={activePanel === 'settings'} onClose={onClosePanel} />
       {hasGraphNodes && activePanel === 'none' ? (
killedBy: app/PanelStack renders the requested panel and keeps the node details slot mounted
statusReason: Unable to find an element by: [data-testid="plugins-panel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="absolute top-2 bottom-2 right-2 z-10 flex flex-col justify-end pointer-events-none [&>*]:pointer-events-auto"
    >

[Killed] ConditionalExpression
src/webview/app/PanelStack.tsx:39:30
       <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
       <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
       <PluginsPanel isOpen={activePanel === 'plugins'} onClose={onClosePanel} />
-      <SettingsPanel isOpen={activePanel === 'settings'} onClose={onClosePanel} />
+      <SettingsPanel isOpen={true} onClose={onClosePanel} />
       {hasGraphNodes && activePanel === 'none' ? (
         <div className="mt-2 self-end">
killedBy: App (mutation targets) renders toolbar when activePanel is none
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  data-testid="settings-panel"
>
  Close Settings
</button> instead

[Killed] EqualityOperator
src/webview/app/PanelStack.tsx:39:30
       <LegendsPanel isOpen={activePanel === 'legends'} onClose={onClosePanel} />
       <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
       <PluginsPanel isOpen={activePanel === 'plugins'} onClose={onClosePanel} />
-      <SettingsPanel isOpen={activePanel === 'settings'} onClose={onClosePanel} />
+      <SettingsPanel isOpen={activePanel !== 'settings'} onClose={onClosePanel} />
       {hasGraphNodes && activePanel === 'none' ? (
         <div className="mt-2 self-end">
killedBy: app/PanelStack renders the settings panel when it is active
statusReason: Unable to find an element by: [data-testid="settings-panel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="absolute top-2 bottom-2 right-2 z-10 flex flex-col justify-end pointer-events-none [&>*]:pointer-events-auto"
    >

[Killed] LogicalOperator
src/webview/app/PanelStack.tsx:40:8
       <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
       <PluginsPanel isOpen={activePanel === 'plugins'} onClose={onClosePanel} />
       <SettingsPanel isOpen={activePanel === 'settings'} onClose={onClosePanel} />
-      {hasGraphNodes && activePanel === 'none' ? (
+      {hasGraphNodes || activePanel === 'none' ? (
         <div className="mt-2 self-end">
           <GraphCornerControls />
killedBy: app/PanelStack renders the requested panel and keeps the node details slot mounted
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="graph-corner-controls"
/> instead

[Killed] EqualityOperator
src/webview/app/PanelStack.tsx:40:25
       <ExportPanel isOpen={activePanel === 'export'} onClose={onClosePanel} />
       <PluginsPanel isOpen={activePanel === 'plugins'} onClose={onClosePanel} />
       <SettingsPanel isOpen={activePanel === 'settings'} onClose={onClosePanel} />
-      {hasGraphNodes && activePanel === 'none' ? (
+      {hasGraphNodes && activePanel !== 'none' ? (
         <div className="mt-2 self-end">
           <GraphCornerControls />
killedBy: app/PanelStack renders the requested panel and keeps the node details slot mounted
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="graph-corner-controls"
/> instead
