[Killed] BlockStatement
webview/app/rulePrompt/model.ts:5:75
 
 export const DEFAULT_LEGEND_RULE_COLOR = '#808080';
 
-export function getRulePromptColor(state: RulePromptState | null): string {
-  return state?.kind === 'legend' ? state.color : DEFAULT_LEGEND_RULE_COLOR;
-}
+export function getRulePromptColor(state: RulePromptState | null): string {}
 
 export function getRulePromptTitle(state: RulePromptState | null): string {
killedBy: app/rulePrompt/model derives title and color defaults from the prompt state
statusReason: expected undefined to be '#808080' // Object.is equality

[Killed] ConditionalExpression
webview/app/rulePrompt/model.ts:6:10
 export const DEFAULT_LEGEND_RULE_COLOR = '#808080';
 
 export function getRulePromptColor(state: RulePromptState | null): string {
-  return state?.kind === 'legend' ? state.color : DEFAULT_LEGEND_RULE_COLOR;
+  return false ? state.color : DEFAULT_LEGEND_RULE_COLOR;
 }
 
killedBy: app/rulePrompt/model derives title and color defaults from the prompt state
statusReason: expected '#808080' to be '#123456' // Object.is equality

[Killed] OptionalChaining
webview/app/rulePrompt/model.ts:6:10
 export const DEFAULT_LEGEND_RULE_COLOR = '#808080';
 
 export function getRulePromptColor(state: RulePromptState | null): string {
-  return state?.kind === 'legend' ? state.color : DEFAULT_LEGEND_RULE_COLOR;
+  return state.kind === 'legend' ? state.color : DEFAULT_LEGEND_RULE_COLOR;
 }
 
killedBy: app/rulePrompt/model derives title and color defaults from the prompt state
statusReason: Cannot read properties of null (reading 'kind')

[Killed] BlockStatement
webview/app/rulePrompt/model.ts:9:75
   return state?.kind === 'legend' ? state.color : DEFAULT_LEGEND_RULE_COLOR;
 }
 
-export function getRulePromptTitle(state: RulePromptState | null): string {
-  if (!state) {
-    return '';
-  }
-
-  return state.kind === 'filter' ? 'Add Filter' : 'Add Legend Group';
-}
+export function getRulePromptTitle(state: RulePromptState | null): string {}
 
 export function createSubmittedRulePromptState(
killedBy: app/rulePrompt/model derives title and color defaults from the prompt state
statusReason: expected undefined to be '' // Object.is equality

[Killed] ConditionalExpression
webview/app/rulePrompt/model.ts:10:7
 }
 
 export function getRulePromptTitle(state: RulePromptState | null): string {
-  if (!state) {
+  if (false) {
     return '';
   }
killedBy: app/rulePrompt/model derives title and color defaults from the prompt state
statusReason: Cannot read properties of null (reading 'kind')

[Killed] BlockStatement
webview/app/rulePrompt/model.ts:10:15
 }
 
 export function getRulePromptTitle(state: RulePromptState | null): string {
-  if (!state) {
-    return '';
-  }
+  if (!state) {}
 
   return state.kind === 'filter' ? 'Add Filter' : 'Add Legend Group';
killedBy: app/rulePrompt/model derives title and color defaults from the prompt state
statusReason: Cannot read properties of null (reading 'kind')

[Killed] ConditionalExpression
webview/app/rulePrompt/model.ts:14:10
     return '';
   }
 
-  return state.kind === 'filter' ? 'Add Filter' : 'Add Legend Group';
+  return false ? 'Add Filter' : 'Add Legend Group';
 }
 
killedBy: app/rulePrompt/model derives title and color defaults from the prompt state
statusReason: expected 'Add Legend Group' to be 'Add Filter' // Object.is equality

[Killed] EqualityOperator
webview/app/rulePrompt/model.ts:14:10
     return '';
   }
 
-  return state.kind === 'filter' ? 'Add Filter' : 'Add Legend Group';
+  return state.kind !== 'filter' ? 'Add Filter' : 'Add Legend Group';
 }
 
killedBy: app/rulePrompt/model derives title and color defaults from the prompt state
statusReason: expected 'Add Legend Group' to be 'Add Filter' // Object.is equality

[Killed] BlockStatement
webview/app/rulePrompt/model.ts:21:20
   state: RulePromptState,
   pattern: string,
   color: string,
-): RulePromptState {
-  if (state.kind === 'filter') {
-    return { kind: 'filter', pattern };
-  }
-
-  return { kind: 'legend', pattern, color, target: state.target };
-}
+): RulePromptState {}
 
killedBy: app/rulePrompt/model creates submitted filter and legend prompt states
statusReason: expected undefined to deeply equal { kind: 'filter', …(1) }

[Killed] ConditionalExpression
webview/app/rulePrompt/model.ts:22:7
   pattern: string,
   color: string,
 ): RulePromptState {
-  if (state.kind === 'filter') {
+  if (false) {
     return { kind: 'filter', pattern };
   }
killedBy: app/rulePrompt/model creates submitted filter and legend prompt states
statusReason: expected { kind: 'legend', …(3) } to deeply equal { kind: 'filter', …(1) }

[Killed] EqualityOperator
webview/app/rulePrompt/model.ts:22:7
   pattern: string,
   color: string,
 ): RulePromptState {
-  if (state.kind === 'filter') {
+  if (state.kind !== 'filter') {
     return { kind: 'filter', pattern };
   }
killedBy: app/rulePrompt/model creates submitted filter and legend prompt states
statusReason: expected { kind: 'legend', …(3) } to deeply equal { kind: 'filter', …(1) }

[Killed] ObjectLiteral
webview/app/rulePrompt/model.ts:23:12
   color: string,
 ): RulePromptState {
   if (state.kind === 'filter') {
-    return { kind: 'filter', pattern };
+    return {};
   }
 
killedBy: app/rulePrompt/model creates submitted filter and legend prompt states
statusReason: expected {} to deeply equal { kind: 'filter', …(1) }

[Killed] ObjectLiteral
webview/app/rulePrompt/model.ts:26:10
     return { kind: 'filter', pattern };
   }
 
-  return { kind: 'legend', pattern, color, target: state.target };
+  return {};
 }
 
killedBy: app/rulePrompt/model creates submitted filter and legend prompt states
statusReason: expected {} to deeply equal { kind: 'legend', …(3) }
