[Killed] BlockStatement
src/webview/app/rulePromptHandlers.ts:28:45
   openLegendPrompt: (rule: { pattern: string; color: string; target: 'node' | 'edge' }) => void;
   handleRulePromptSubmit: (nextState: RulePromptState) => void;
 } {
-  const closeRulePrompt = useCallback(() => {
-    setRulePrompt(null);
-  }, [setRulePrompt]);
+  const closeRulePrompt = useCallback(() => {}, [setRulePrompt]);
 
   const openFilterPrompt = useCallback((pattern: string) => {
killedBy: app/rulePromptHandlers uses the latest prompt setter callbacks after rerendering
statusReason: expected 3rd "spy" call to have been called with [ null ], but called only 2 times

[Killed] BlockStatement
src/webview/app/rulePromptHandlers.ts:32:61
     setRulePrompt(null);
   }, [setRulePrompt]);
 
-  const openFilterPrompt = useCallback((pattern: string) => {
-    setRulePrompt({ kind: 'filter', pattern });
-  }, [setRulePrompt]);
+  const openFilterPrompt = useCallback((pattern: string) => {}, [setRulePrompt]);
 
   const openLegendPrompt = useCallback((rule: { pattern: string; color: string; target: 'node' | 'edge' }) => {
killedBy: app/rulePromptHandlers opens and closes filter prompts and posts trimmed filter pattern updates
statusReason: expected "spy" to be called with arguments: [ { kind: 'filter', …(1) } ]

Received: 

  1st spy call:

  [
-   {

[Killed] BlockStatement
src/webview/app/rulePromptHandlers.ts:36:111
     setRulePrompt({ kind: 'filter', pattern });
   }, [setRulePrompt]);
 
-  const openLegendPrompt = useCallback((rule: { pattern: string; color: string; target: 'node' | 'edge' }) => {
-    setRulePrompt({ kind: 'legend', ...rule });
-  }, [setRulePrompt]);
+  const openLegendPrompt = useCallback((rule: { pattern: string; color: string; target: 'node' | 'edge' }) => {}, [setRulePrompt]);
 
   const handleRulePromptSubmit = useCallback((nextState: RulePromptState) => {
killedBy: app/rulePromptHandlers opens legend prompts and posts generated legend updates
statusReason: expected "spy" to be called with arguments: [ { kind: 'legend', …(3) } ]

Received: 

  1st spy call:

  [
-   {

[Killed] BlockStatement
src/webview/app/rulePromptHandlers.ts:40:78
     setRulePrompt({ kind: 'legend', ...rule });
   }, [setRulePrompt]);
 
-  const handleRulePromptSubmit = useCallback((nextState: RulePromptState) => {
-    if (nextState.kind === 'filter') {
-      const nextPatterns = buildNextFilterPatterns(filterPatterns, nextState.pattern);
-      if (nextPatterns) {
-        setFilterPatterns(nextPatterns);
-        postMessage({ type: 'UPDATE_FILTER_PATTERNS', payload: { patterns: nextPatterns } });
-      }
-      setRulePrompt(null);
-      return;
-    }
-
-    const nextLegends = buildNextLegendRules(
-      userLegendRules,
-      nextState,
-      () => `legend:${Date.now()}:${Math.random().toString(36).slice(2, 8)}`,
-    );
-    if (nextLegends) {
-      setOptimisticUserLegends(nextLegends);
-      postMessage({
-        type: 'UPDATE_LEGENDS',
-        payload: { legends: nextLegends },
-      });
-    }
-    setRulePrompt(null);
-  }, [filterPatterns, setFilterPatterns, setOptimisticUserLegends, setRulePrompt, userLegendRules]);
+  const handleRulePromptSubmit = useCallback((nextState: RulePromptState) => {}, [filterPatterns, setFilterPatterns, setOptimisticUserLegends, setRulePrompt, userLegendRules]);
 
   return {
killedBy: app/rulePromptHandlers opens and closes filter prompts and posts trimmed filter pattern updates
statusReason: expected "spy" to be called with arguments: [ [ 'src/**', 'src/lib/**' ] ]

Number of calls: 0

[Killed] EqualityOperator
src/webview/app/rulePromptHandlers.ts:41:9
   }, [setRulePrompt]);
 
   const handleRulePromptSubmit = useCallback((nextState: RulePromptState) => {
-    if (nextState.kind === 'filter') {
+    if (nextState.kind !== 'filter') {
       const nextPatterns = buildNextFilterPatterns(filterPatterns, nextState.pattern);
       if (nextPatterns) {
killedBy: app/rulePromptHandlers opens and closes filter prompts and posts trimmed filter pattern updates
statusReason: expected "spy" to be called with arguments: [ [ 'src/**', 'src/lib/**' ] ]

Number of calls: 0

[Killed] ConditionalExpression
src/webview/app/rulePromptHandlers.ts:41:9
   }, [setRulePrompt]);
 
   const handleRulePromptSubmit = useCallback((nextState: RulePromptState) => {
-    if (nextState.kind === 'filter') {
+    if (true) {
       const nextPatterns = buildNextFilterPatterns(filterPatterns, nextState.pattern);
       if (nextPatterns) {
killedBy: app/rulePromptHandlers opens legend prompts and posts generated legend updates
statusReason: expected "spy" to be called with arguments: [ [ { id: 'existing', …(3) }, …(1) ] ]

Number of calls: 0

[Killed] ConditionalExpression
src/webview/app/rulePromptHandlers.ts:43:11
   const handleRulePromptSubmit = useCallback((nextState: RulePromptState) => {
     if (nextState.kind === 'filter') {
       const nextPatterns = buildNextFilterPatterns(filterPatterns, nextState.pattern);
-      if (nextPatterns) {
+      if (false) {
         setFilterPatterns(nextPatterns);
         postMessage({ type: 'UPDATE_FILTER_PATTERNS', payload: { patterns: nextPatterns } });
killedBy: app/rulePromptHandlers opens and closes filter prompts and posts trimmed filter pattern updates
statusReason: expected "spy" to be called with arguments: [ [ 'src/**', 'src/lib/**' ] ]

Number of calls: 0

[Killed] BlockStatement
src/webview/app/rulePromptHandlers.ts:43:25
   const handleRulePromptSubmit = useCallback((nextState: RulePromptState) => {
     if (nextState.kind === 'filter') {
       const nextPatterns = buildNextFilterPatterns(filterPatterns, nextState.pattern);
-      if (nextPatterns) {
-        setFilterPatterns(nextPatterns);
-        postMessage({ type: 'UPDATE_FILTER_PATTERNS', payload: { patterns: nextPatterns } });
-      }
+      if (nextPatterns) {}
       setRulePrompt(null);
       return;
killedBy: app/rulePromptHandlers opens and closes filter prompts and posts trimmed filter pattern updates
statusReason: expected "spy" to be called with arguments: [ [ 'src/**', 'src/lib/**' ] ]

Number of calls: 0

[Killed] StringLiteral
src/webview/app/rulePromptHandlers.ts:45:29
       const nextPatterns = buildNextFilterPatterns(filterPatterns, nextState.pattern);
       if (nextPatterns) {
         setFilterPatterns(nextPatterns);
-        postMessage({ type: 'UPDATE_FILTER_PATTERNS', payload: { patterns: nextPatterns } });
+        postMessage({ type: "", payload: { patterns: nextPatterns } });
       }
       setRulePrompt(null);
killedBy: app/rulePromptHandlers opens and closes filter prompts and posts trimmed filter pattern updates
statusReason: expected [ { type: '', payload: { …(1) } } ] to deep equally contain { Object (type, payload) }

[Killed] MethodExpression
src/webview/app/rulePromptHandlers.ts:54:37
     const nextLegends = buildNextLegendRules(
       userLegendRules,
       nextState,
-      () => `legend:${Date.now()}:${Math.random().toString(36).slice(2, 8)}`,
+      () => `legend:${Date.now()}:${Math.random().toString(36)}`,
     );
     if (nextLegends) {
killedBy: app/rulePromptHandlers opens legend prompts and posts generated legend updates
statusReason: expected "spy" to be called with arguments: [ [ { id: 'existing', …(3) }, …(1) ] ]

Received: 

  1st spy call:

@@ -6,11 +6,11 @@
        "pattern": "src/**",

[Killed] ArrowFunction
src/webview/app/rulePromptHandlers.ts:54:7
     const nextLegends = buildNextLegendRules(
       userLegendRules,
       nextState,
-      () => `legend:${Date.now()}:${Math.random().toString(36).slice(2, 8)}`,
+      () => undefined,
     );
     if (nextLegends) {
killedBy: app/rulePromptHandlers opens legend prompts and posts generated legend updates
statusReason: expected "spy" to be called with arguments: [ [ { id: 'existing', …(3) }, …(1) ] ]

Received: 

  1st spy call:

@@ -6,11 +6,11 @@
        "pattern": "src/**",

[Killed] ConditionalExpression
src/webview/app/rulePromptHandlers.ts:56:9
       nextState,
       () => `legend:${Date.now()}:${Math.random().toString(36).slice(2, 8)}`,
     );
-    if (nextLegends) {
+    if (false) {
       setOptimisticUserLegends(nextLegends);
       postMessage({
killedBy: app/rulePromptHandlers opens legend prompts and posts generated legend updates
statusReason: expected "spy" to be called with arguments: [ [ { id: 'existing', …(3) }, …(1) ] ]

Number of calls: 0

[Killed] ConditionalExpression
src/webview/app/rulePromptHandlers.ts:56:9
       nextState,
       () => `legend:${Date.now()}:${Math.random().toString(36).slice(2, 8)}`,
     );
-    if (nextLegends) {
+    if (true) {
       setOptimisticUserLegends(nextLegends);
       postMessage({
killedBy: app/rulePromptHandlers uses the latest filters and legend rules and closes even when no legend update is produced
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      null,

[Killed] ObjectLiteral
src/webview/app/rulePromptHandlers.ts:58:19
     );
     if (nextLegends) {
       setOptimisticUserLegends(nextLegends);
-      postMessage({
-        type: 'UPDATE_LEGENDS',
-        payload: { legends: nextLegends },
-      });
+      postMessage({});
     }
     setRulePrompt(null);
killedBy: app/rulePromptHandlers opens legend prompts and posts generated legend updates
statusReason: expected [ {} ] to deep equally contain { type: 'UPDATE_LEGENDS', …(1) }
