[Killed] BlockStatement
webview/components/export/actions.ts:9:54
   onSelect: () => void;
 }
 
-function postWindowMessage(type: string): () => void {
-  return () => window.postMessage({ type }, '*');
-}
+function postWindowMessage(type: string): () => void {}
 
 export function buildImageItems(): ExportActionItem[] {
killedBy: webview/export/actions builds image export items that post the correct window messages
statusReason: items[0]?.onSelect is not a function

[Killed] ArrowFunction
webview/components/export/actions.ts:10:10
 }
 
 function postWindowMessage(type: string): () => void {
-  return () => window.postMessage({ type }, '*');
+  return () => undefined;
 }
 
killedBy: webview/export/actions builds image export items that post the correct window messages
statusReason: expected 1st "spy" call to have been called with [ { type: 'REQUEST_EXPORT_PNG' }, '*' ], but called only 0 times

[Killed] ObjectLiteral
webview/components/export/actions.ts:10:35
 }
 
 function postWindowMessage(type: string): () => void {
-  return () => window.postMessage({ type }, '*');
+  return () => window.postMessage({}, '*');
 }
 
killedBy: webview/export/actions builds image export items that post the correct window messages
statusReason: expected 1st "spy" call to have been called with [ { type: 'REQUEST_EXPORT_PNG' }, '*' ]

[Killed] BlockStatement
webview/components/export/actions.ts:13:55
   return () => window.postMessage({ type }, '*');
 }
 
-export function buildImageItems(): ExportActionItem[] {
-  return [
-    {
-      id: 'image:png',
-      label: 'Export as PNG',
-      onSelect: postWindowMessage('REQUEST_EXPORT_PNG'),
-    },
-    {
-      id: 'image:svg',
-      label: 'Export as SVG',
-      onSelect: postWindowMessage('REQUEST_EXPORT_SVG'),
-    },
-    {
-      id: 'image:jpeg',
-      label: 'Export as JPEG',
-      onSelect: postWindowMessage('REQUEST_EXPORT_JPEG'),
-    },
-  ];
-}
+export function buildImageItems(): ExportActionItem[] {}
 
 export function buildGraphItems(): ExportActionItem[] {
killedBy: webview/export/actions builds image export items that post the correct window messages
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] StringLiteral
webview/components/export/actions.ts:22:14
     },
     {
       id: 'image:svg',
-      label: 'Export as SVG',
+      label: "",
       onSelect: postWindowMessage('REQUEST_EXPORT_SVG'),
     },
killedBy: webview/export/actions builds image export items that post the correct window messages
statusReason: expected [ 'Export as PNG', '', …(1) ] to deeply equal [ 'Export as PNG', …(2) ]

[Killed] StringLiteral
webview/components/export/actions.ts:23:35
     {
       id: 'image:svg',
       label: 'Export as SVG',
-      onSelect: postWindowMessage('REQUEST_EXPORT_SVG'),
+      onSelect: postWindowMessage(""),
     },
     {
killedBy: webview/export/actions builds image export items that post the correct window messages
statusReason: expected 2nd "spy" call to have been called with [ { type: 'REQUEST_EXPORT_SVG' }, '*' ]

[Killed] ObjectLiteral
webview/components/export/actions.ts:25:5
       label: 'Export as SVG',
       onSelect: postWindowMessage('REQUEST_EXPORT_SVG'),
     },
-    {
-      id: 'image:jpeg',
-      label: 'Export as JPEG',
-      onSelect: postWindowMessage('REQUEST_EXPORT_JPEG'),
-    },
+    {},
   ];
 }
killedBy: webview/export/actions builds image export items that post the correct window messages
statusReason: expected [ 'image:png', 'image:svg', undefined ] to deeply equal [ 'image:png', 'image:svg', …(1) ]

[Killed] StringLiteral
webview/components/export/actions.ts:26:11
       onSelect: postWindowMessage('REQUEST_EXPORT_SVG'),
     },
     {
-      id: 'image:jpeg',
+      id: "",
       label: 'Export as JPEG',
       onSelect: postWindowMessage('REQUEST_EXPORT_JPEG'),
killedBy: webview/export/actions builds image export items that post the correct window messages
statusReason: expected [ 'image:png', 'image:svg', '' ] to deeply equal [ 'image:png', 'image:svg', …(1) ]

[Killed] BlockStatement
webview/components/export/actions.ts:33:55
   ];
 }
 
-export function buildGraphItems(): ExportActionItem[] {
-  return [
-    {
-      id: 'graph:json',
-      label: 'Export as JSON',
-      onSelect: postWindowMessage('REQUEST_EXPORT_JSON'),
-    },
-    {
-      id: 'graph:markdown',
-      label: 'Export as Markdown',
-      onSelect: postWindowMessage('REQUEST_EXPORT_MD'),
-    },
-    {
-      id: 'graph:symbols',
-      label: 'Export Symbols as JSON',
-      onSelect: () => postMessage({ type: 'EXPORT_SYMBOLS_JSON' }),
-    },
-  ];
-}
+export function buildGraphItems(): ExportActionItem[] {}
 
 export function runPluginExport(pluginId: string, index: number): void {
killedBy: webview/export/actions builds graph export items that post window and host messages from the matching entries
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrayDeclaration
webview/components/export/actions.ts:34:10
 }
 
 export function buildGraphItems(): ExportActionItem[] {
-  return [
-    {
-      id: 'graph:json',
-      label: 'Export as JSON',
-      onSelect: postWindowMessage('REQUEST_EXPORT_JSON'),
-    },
-    {
-      id: 'graph:markdown',
-      label: 'Export as Markdown',
-      onSelect: postWindowMessage('REQUEST_EXPORT_MD'),
-    },
-    {
-      id: 'graph:symbols',
-      label: 'Export Symbols as JSON',
-      onSelect: () => postMessage({ type: 'EXPORT_SYMBOLS_JSON' }),
-    },
-  ];
+  return [];
 }
 
killedBy: webview/export/actions builds graph export items that post window and host messages from the matching entries
statusReason: expected [] to deeply equal [ Array(3) ]

[Killed] StringLiteral
webview/components/export/actions.ts:36:11
 export function buildGraphItems(): ExportActionItem[] {
   return [
     {
-      id: 'graph:json',
+      id: "",
       label: 'Export as JSON',
       onSelect: postWindowMessage('REQUEST_EXPORT_JSON'),
killedBy: webview/export/actions builds graph export items that post window and host messages from the matching entries
statusReason: expected [ '', 'graph:markdown', …(1) ] to deeply equal [ Array(3) ]

[Killed] StringLiteral
webview/components/export/actions.ts:37:14
   return [
     {
       id: 'graph:json',
-      label: 'Export as JSON',
+      label: "",
       onSelect: postWindowMessage('REQUEST_EXPORT_JSON'),
     },
killedBy: ExportPanel posts image and graph export messages from the shared list rows
statusReason: Unable to find an element with the text: Export as JSON. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-popover/95 backdrop-blur-sm rounded-lg border w-72 shadow-lg max-h-full flex flex-col overflow-hid

[Killed] StringLiteral
webview/components/export/actions.ts:41:11
       onSelect: postWindowMessage('REQUEST_EXPORT_JSON'),
     },
     {
-      id: 'graph:markdown',
+      id: "",
       label: 'Export as Markdown',
       onSelect: postWindowMessage('REQUEST_EXPORT_MD'),
killedBy: webview/export/actions builds graph export items that post window and host messages from the matching entries
statusReason: expected [ 'graph:json', '', 'graph:symbols' ] to deeply equal [ Array(3) ]

[Survived] StringLiteral
webview/components/export/actions.ts:42:14
     },
     {
       id: 'graph:markdown',
-      label: 'Export as Markdown',
+      label: "",
       onSelect: postWindowMessage('REQUEST_EXPORT_MD'),
     },

[Killed] ObjectLiteral
webview/components/export/actions.ts:45:5
       label: 'Export as Markdown',
       onSelect: postWindowMessage('REQUEST_EXPORT_MD'),
     },
-    {
-      id: 'graph:symbols',
-      label: 'Export Symbols as JSON',
-      onSelect: () => postMessage({ type: 'EXPORT_SYMBOLS_JSON' }),
-    },
+    {},
   ];
 }
killedBy: webview/export/actions builds graph export items that post window and host messages from the matching entries
statusReason: expected [ Array(3) ] to deeply equal [ Array(3) ]

[Killed] StringLiteral
webview/components/export/actions.ts:46:11
       onSelect: postWindowMessage('REQUEST_EXPORT_MD'),
     },
     {
-      id: 'graph:symbols',
+      id: "",
       label: 'Export Symbols as JSON',
       onSelect: () => postMessage({ type: 'EXPORT_SYMBOLS_JSON' }),
killedBy: webview/export/actions builds graph export items that post window and host messages from the matching entries
statusReason: expected [ 'graph:json', 'graph:markdown', '' ] to deeply equal [ Array(3) ]

[Killed] StringLiteral
webview/components/export/actions.ts:47:14
     },
     {
       id: 'graph:symbols',
-      label: 'Export Symbols as JSON',
+      label: "",
       onSelect: () => postMessage({ type: 'EXPORT_SYMBOLS_JSON' }),
     },
killedBy: ExportPanel posts image and graph export messages from the shared list rows
statusReason: Unable to find an element with the text: Export Symbols as JSON. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-popover/95 backdrop-blur-sm rounded-lg border w-72 shadow-lg max-h-full flex flex-col over

[Killed] ArrowFunction
webview/components/export/actions.ts:48:17
     {
       id: 'graph:symbols',
       label: 'Export Symbols as JSON',
-      onSelect: () => postMessage({ type: 'EXPORT_SYMBOLS_JSON' }),
+      onSelect: () => undefined,
     },
   ];
killedBy: webview/export/actions builds graph export items that post window and host messages from the matching entries
statusReason: expected "spy" to be called with arguments: [ { type: 'EXPORT_SYMBOLS_JSON' } ]

Number of calls: 0

[Killed] BlockStatement
webview/components/export/actions.ts:53:72
   ];
 }
 
-export function runPluginExport(pluginId: string, index: number): void {
-  postMessage({
-    type: 'RUN_PLUGIN_EXPORT',
-    payload: {
-      pluginId,
-      index,
-    },
-  });
-}
+export function runPluginExport(pluginId: string, index: number): void {}
 
killedBy: webview/export/actions posts plugin exports through the host API with plugin id and index
statusReason: expected "spy" to be called with arguments: [ { type: 'RUN_PLUGIN_EXPORT', …(1) } ]

Number of calls: 0
