[Killed] BlockStatement
src/webview/components/Toolbar.tsx:31:24
   expandLabel: string;
   collapseLabel: string;
   direction: 'up' | 'down';
-}): React.ReactElement {
-  const title = expanded ? collapseLabel : expandLabel;
-  const expandedPath = direction === 'up' ? mdiChevronUp : mdiChevronDown;
-  const collapsedPath = direction === 'up' ? mdiChevronDown : mdiChevronUp;
-
-  return (
-    <Tooltip>
-      <TooltipTrigger asChild>
-        <CollapsibleTrigger asChild>
-          <Button
-            variant="outline"
-            size="icon"
-            className="h-7 w-7 bg-transparent"
-            title={title}
-          >
-            <MdiIcon path={expanded ? expandedPath : collapsedPath} size={16} />
-          </Button>
-        </CollapsibleTrigger>
-      </TooltipTrigger>
-      <TooltipContent side="right">{title}</TooltipContent>
-    </Tooltip>
-  );
-}
+}): React.ReactElement {}
 
 function ToolbarTopSection({
killedBy: Toolbar layout renders separate collapse toggles for the top and bottom toolbar groups
statusReason: Unable to find an accessible element with the role "button" and name "Collapse Top Toolbar"

Here are the accessible roles:

  button:

  Name "":
  <button

[Killed] ConditionalExpression
src/webview/components/Toolbar.tsx:33:24
   direction: 'up' | 'down';
 }): React.ReactElement {
   const title = expanded ? collapseLabel : expandLabel;
-  const expandedPath = direction === 'up' ? mdiChevronUp : mdiChevronDown;
+  const expandedPath = false ? mdiChevronUp : mdiChevronDown;
   const collapsedPath = direction === 'up' ? mdiChevronDown : mdiChevronUp;
 
killedBy: Toolbar layout renders separate collapse toggles for the top and bottom toolbar groups
statusReason: expected 'M7.41,8.58L12,13.17L16.59,8.58L18,10L…' to be 'M7.41,15.41L12,10.83L16.59,15.41L18,1…' // Object.is equality

[Killed] ConditionalExpression
src/webview/components/Toolbar.tsx:33:24
   direction: 'up' | 'down';
 }): React.ReactElement {
   const title = expanded ? collapseLabel : expandLabel;
-  const expandedPath = direction === 'up' ? mdiChevronUp : mdiChevronDown;
+  const expandedPath = true ? mdiChevronUp : mdiChevronDown;
   const collapsedPath = direction === 'up' ? mdiChevronDown : mdiChevronUp;
 
killedBy: Toolbar layout renders separate collapse toggles for the top and bottom toolbar groups
statusReason: expected 'M7.41,15.41L12,10.83L16.59,15.41L18,1…' to be 'M7.41,8.58L12,13.17L16.59,8.58L18,10L…' // Object.is equality

[Killed] ConditionalExpression
src/webview/components/Toolbar.tsx:34:25
 }): React.ReactElement {
   const title = expanded ? collapseLabel : expandLabel;
   const expandedPath = direction === 'up' ? mdiChevronUp : mdiChevronDown;
-  const collapsedPath = direction === 'up' ? mdiChevronDown : mdiChevronUp;
+  const collapsedPath = true ? mdiChevronDown : mdiChevronUp;
 
   return (
killedBy: Toolbar layout collapses only the bottom toolbar controls and keeps the top actions visible
statusReason: expected 'M7.41,8.58L12,13.17L16.59,8.58L18,10L…' to be 'M7.41,15.41L12,10.83L16.59,15.41L18,1…' // Object.is equality

[Killed] ConditionalExpression
src/webview/components/Toolbar.tsx:34:25
 }): React.ReactElement {
   const title = expanded ? collapseLabel : expandLabel;
   const expandedPath = direction === 'up' ? mdiChevronUp : mdiChevronDown;
-  const collapsedPath = direction === 'up' ? mdiChevronDown : mdiChevronUp;
+  const collapsedPath = false ? mdiChevronDown : mdiChevronUp;
 
   return (
killedBy: Toolbar layout collapses only the top toolbar controls and keeps the bottom actions visible
statusReason: expected 'M7.41,15.41L12,10.83L16.59,15.41L18,1…' to be 'M7.41,8.58L12,13.17L16.59,8.58L18,10L…' // Object.is equality

[Killed] StringLiteral
src/webview/components/Toolbar.tsx:69:13
           forceMount
           data-testid="toolbar-primary-controls"
           className={cn(
-            'overflow-hidden transition-[max-height,opacity,margin,transform] duration-200 ease-out',
+            "",
             expanded
               ? 'mb-1.5 max-h-96 opacity-100 translate-y-0'
killedBy: Toolbar layout collapses only the top toolbar controls and keeps the bottom actions visible
statusReason: expect(element).toHaveClass("overflow-hidden transition-[max-height,opacity,margin,transform] duration-200 ease-out mb-0 max-h-0 opacity-0 -translate-y-1 pointer-events-none")

Expected the element to have class:
  overflow-hidden transition-[max-height,opacity,margin,transform] duration-200 ease-out mb-0 max-h-0 opacity-0 -translate-y-1 pointer-events-none
Received:
  mb-0 max-h-0 opacity-0 -tran

[Killed] StringLiteral
src/webview/components/Toolbar.tsx:71:17
           className={cn(
             'overflow-hidden transition-[max-height,opacity,margin,transform] duration-200 ease-out',
             expanded
-              ? 'mb-1.5 max-h-96 opacity-100 translate-y-0'
+              ? ""
               : 'mb-0 max-h-0 opacity-0 -translate-y-1 pointer-events-none',
           )}
killedBy: Toolbar layout collapses only the bottom toolbar controls and keeps the top actions visible
statusReason: expect(element).toHaveClass("opacity-100")

Expected the element to have class:
  opacity-100
Received:
  overflow-hidden transition-[max-height,opacity,margin,transform] duration-200 ease-out

[Killed] BlockStatement
src/webview/components/Toolbar.tsx:129:83
   );
 }
 
-export default function Toolbar({ pluginHost }: ToolbarProps): React.ReactElement {
-  const [isTopExpanded, setIsTopExpanded] = useState(true);
-  const [isBottomExpanded, setIsBottomExpanded] = useState(true);
-
-  return (
-    <TooltipProvider delayDuration={300}>
-      <div
-        data-testid="toolbar"
-        className="flex h-full min-h-0 flex-col items-center justify-between gap-3 bg-transparent"
-      >
-        <ToolbarTopSection expanded={isTopExpanded} onExpandedChange={setIsTopExpanded} />
-        {pluginHost ? (
-          <SlotHost
-            pluginHost={pluginHost}
-            slot="toolbar"
-            data-testid="toolbar-plugin-slot"
-            className="flex flex-col items-center gap-1.5"
-          />
-        ) : null}
-        <ToolbarBottomSection expanded={isBottomExpanded} onExpandedChange={setIsBottomExpanded} />
-      </div>
-    </TooltipProvider>
-  );
-}
+export default function Toolbar({ pluginHost }: ToolbarProps): React.ReactElement {}
 
killedBy: Toolbar layout renders a vertical transparent toolbar with top and bottom groups
statusReason: expected null to be truthy

[Killed] BooleanLiteral
src/webview/components/Toolbar.tsx:130:54
 }
 
 export default function Toolbar({ pluginHost }: ToolbarProps): React.ReactElement {
-  const [isTopExpanded, setIsTopExpanded] = useState(true);
+  const [isTopExpanded, setIsTopExpanded] = useState(false);
   const [isBottomExpanded, setIsBottomExpanded] = useState(true);
 
killedBy: Toolbar layout renders separate collapse toggles for the top and bottom toolbar groups
statusReason: Unable to find an accessible element with the role "button" and name "Collapse Top Toolbar"

Here are the accessible roles:

  button:

  Name "":
  <button

[Killed] BooleanLiteral
src/webview/components/Toolbar.tsx:131:60
 
 export default function Toolbar({ pluginHost }: ToolbarProps): React.ReactElement {
   const [isTopExpanded, setIsTopExpanded] = useState(true);
-  const [isBottomExpanded, setIsBottomExpanded] = useState(true);
+  const [isBottomExpanded, setIsBottomExpanded] = useState(false);
 
   return (
killedBy: Toolbar layout renders separate collapse toggles for the top and bottom toolbar groups
statusReason: Unable to find an accessible element with the role "button" and name "Collapse Bottom Toolbar"

Here are the accessible roles:

  button:

  Name "":
  <button
